/* automatically generated by rust-bindgen 0.69.5 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const FZ_ENABLE_SPOT_RENDERING: u32 = 1;
pub const FZ_PLOTTERS_N: u32 = 1;
pub const FZ_PLOTTERS_G: u32 = 1;
pub const FZ_PLOTTERS_RGB: u32 = 1;
pub const FZ_PLOTTERS_CMYK: u32 = 1;
pub const FZ_ENABLE_HYPHEN: u32 = 1;
pub const FZ_ENABLE_HYPHEN_ALL: u32 = 1;
pub const FZ_ENABLE_PDF: u32 = 1;
pub const FZ_ENABLE_XPS: u32 = 1;
pub const FZ_ENABLE_SVG: u32 = 1;
pub const FZ_ENABLE_CBZ: u32 = 1;
pub const FZ_ENABLE_IMG: u32 = 1;
pub const FZ_ENABLE_HTML: u32 = 1;
pub const FZ_ENABLE_MD: u32 = 1;
pub const FZ_ENABLE_EPUB: u32 = 1;
pub const FZ_ENABLE_FB2: u32 = 1;
pub const FZ_ENABLE_MOBI: u32 = 1;
pub const FZ_ENABLE_TXT: u32 = 1;
pub const FZ_ENABLE_OFFICE: u32 = 1;
pub const FZ_ENABLE_OCR_OUTPUT: u32 = 1;
pub const FZ_ENABLE_ODT_OUTPUT: u32 = 1;
pub const FZ_ENABLE_DOCX_OUTPUT: u32 = 1;
pub const FZ_ENABLE_JPX: u32 = 1;
pub const FZ_ENABLE_BROTLI: u32 = 1;
pub const FZ_ENABLE_JS: u32 = 1;
pub const FZ_ENABLE_ICC: u32 = 1;
pub const FZ_ENABLE_HTML_ENGINE: u32 = 1;
pub const FZ_ENABLE_BARCODE: u32 = 1;
pub const FZ_PI: f64 = 3.14159265;
pub const FZ_RADIAN: f64 = 57.2957795;
pub const FZ_DEGREE: f64 = 0.017453292;
pub const FZ_SQRT2: f64 = 1.41421356;
pub const FZ_LN2: f64 = 0.69314718;
pub const FZ_VERBOSE_EXCEPTIONS: u32 = 0;
pub const FZ_JMPBUF_ALIGN: u32 = 32;
pub const FZ_REPLACEMENT_CHARACTER: u32 = 65533;
pub const FZ_AES_DECRYPT: u32 = 0;
pub const FZ_AES_ENCRYPT: u32 = 1;
pub const FZ_HASH_TABLE_KEY_LENGTH: u32 = 48;
pub const FZ_MAX_TRUSTWORTHY_ASCENT: u32 = 8;
pub const FZ_MAX_TRUSTWORTHY_DESCENT: i32 = -3;
pub const FZ_META_FORMAT: &[u8; 7] = b"format\0";
pub const FZ_META_ENCRYPTION: &[u8; 11] = b"encryption\0";
pub const FZ_META_INFO: &[u8; 6] = b"info:\0";
pub const FZ_META_INFO_TITLE: &[u8; 11] = b"info:Title\0";
pub const FZ_META_INFO_AUTHOR: &[u8; 12] = b"info:Author\0";
pub const FZ_META_INFO_SUBJECT: &[u8; 13] = b"info:Subject\0";
pub const FZ_META_INFO_KEYWORDS: &[u8; 14] = b"info:Keywords\0";
pub const FZ_META_INFO_CREATOR: &[u8; 13] = b"info:Creator\0";
pub const FZ_META_INFO_PRODUCER: &[u8; 14] = b"info:Producer\0";
pub const FZ_META_INFO_CREATIONDATE: &[u8; 18] = b"info:CreationDate\0";
pub const FZ_META_INFO_MODIFICATIONDATE: &[u8; 13] = b"info:ModDate\0";
pub const PDF_MAX_OBJECT_NUMBER: u32 = 8388607;
pub const PDF_MAX_GEN_NUMBER: u32 = 65535;
pub const PDF_MRANGE_CAP: u32 = 256;
pub type wchar_t = ::std::os::raw::c_int;
pub type va_list = __builtin_va_list;
pub type sigjmp_buf = [::std::os::raw::c_int; 49usize];
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __darwin_off_t = __int64_t;
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    const UNINIT: ::std::mem::MaybeUninit<__sbuf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sbuf>(),
        16usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<__sbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[test]
fn bindgen_test_layout___sFILE() {
    const UNINIT: ::std::mem::MaybeUninit<__sFILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sFILE>(),
        152usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        ::std::mem::align_of::<__sFILE>(),
        8usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_p)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._r) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._w) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._file) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._bf) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_bf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lbfsize) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lbfsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cookie) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_cookie)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._close) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_close)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._read) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._seek) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_seek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._write) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ub) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ub)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._extra) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_extra)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ur) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ubuf) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ubuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._nbuf) as usize - ptr as usize },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_nbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lb) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._blksize) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_blksize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_offset)
        )
    );
}
pub type FILE = __sFILE;
pub type fz_jmp_buf = sigjmp_buf;
extern "C" {
    pub fn fz_stat_ctime(path: *const ::std::os::raw::c_char) -> i64;
}
extern "C" {
    pub fn fz_stat_mtime(path: *const ::std::os::raw::c_char) -> i64;
}
extern "C" {
    pub fn fz_mkdir(path: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Range checking atof"]
    pub fn fz_atof(s: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    #[doc = "atoi that copes with NULL"]
    pub fn fz_atoi(s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "64bit atoi that copes with NULL"]
    pub fn fz_atoi64(s: *const ::std::os::raw::c_char) -> i64;
}
extern "C" {
    #[doc = "size_t atoi that copes with NULL.\n\nNOTE: limited to 63bits. Negative numbers\nare returned as 0."]
    pub fn fz_atoz(s: *const ::std::os::raw::c_char) -> usize;
}
#[doc = "fz_point is a point in a two-dimensional space."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_point {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_fz_point() {
    const UNINIT: ::std::mem::MaybeUninit<fz_point> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_point>(),
        8usize,
        concat!("Size of: ", stringify!(fz_point))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_point>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_point))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_point),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_point),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_rect {
    pub x0: f32,
    pub y0: f32,
    pub x1: f32,
    pub y1: f32,
}
#[test]
fn bindgen_test_layout_fz_rect() {
    const UNINIT: ::std::mem::MaybeUninit<fz_rect> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_rect>(),
        16usize,
        concat!("Size of: ", stringify!(fz_rect))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_rect>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_rect))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_rect),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_rect),
            "::",
            stringify!(y0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_rect),
            "::",
            stringify!(x1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y1) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_rect),
            "::",
            stringify!(y1)
        )
    );
}
#[doc = "fz_irect is a rectangle using integers instead of floats.\n\nIt's used in the draw device and for pixmap dimensions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_irect {
    pub x0: ::std::os::raw::c_int,
    pub y0: ::std::os::raw::c_int,
    pub x1: ::std::os::raw::c_int,
    pub y1: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_fz_irect() {
    const UNINIT: ::std::mem::MaybeUninit<fz_irect> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_irect>(),
        16usize,
        concat!("Size of: ", stringify!(fz_irect))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_irect>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_irect))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_irect),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_irect),
            "::",
            stringify!(y0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_irect),
            "::",
            stringify!(x1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y1) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_irect),
            "::",
            stringify!(y1)
        )
    );
}
#[doc = "fz_matrix is a row-major 3x3 matrix used for representing\ntransformations of coordinates throughout MuPDF.\n\nSince all points reside in a two-dimensional space, one vector\nis always a constant unit vector; hence only some elements may\nvary in a matrix. Below is how the elements map between\ndifferent representations.\n\n/ a b 0 \\\n| c d 0 | normally represented as [ a b c d e f ].\n\\ e f 1 /"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_matrix {
    pub a: f32,
    pub b: f32,
    pub c: f32,
    pub d: f32,
    pub e: f32,
    pub f: f32,
}
#[test]
fn bindgen_test_layout_fz_matrix() {
    const UNINIT: ::std::mem::MaybeUninit<fz_matrix> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_matrix>(),
        24usize,
        concat!("Size of: ", stringify!(fz_matrix))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_matrix>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_matrix))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_matrix),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_matrix),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).c) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_matrix),
            "::",
            stringify!(c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_matrix),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_matrix),
            "::",
            stringify!(e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_matrix),
            "::",
            stringify!(f)
        )
    );
}
extern "C" {
    #[doc = "Multiply two matrices.\n\nThe order of the two matrices are important since matrix\nmultiplication is not commutative.\n\nReturns result."]
    pub fn fz_concat(left: fz_matrix, right: fz_matrix) -> fz_matrix;
}
extern "C" {
    #[doc = "Create a scaling matrix.\n\nThe returned matrix is of the form [ sx 0 0 sy 0 0 ].\n\nm: Pointer to the matrix to populate\n\nsx, sy: Scaling factors along the X- and Y-axes. A scaling\nfactor of 1.0 will not cause any scaling along the relevant\naxis.\n\nReturns m."]
    pub fn fz_scale(sx: f32, sy: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Scale a matrix by premultiplication.\n\nm: Pointer to the matrix to scale\n\nsx, sy: Scaling factors along the X- and Y-axes. A scaling\nfactor of 1.0 will not cause any scaling along the relevant\naxis.\n\nReturns m (updated)."]
    pub fn fz_pre_scale(m: fz_matrix, sx: f32, sy: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Scale a matrix by postmultiplication.\n\nm: Pointer to the matrix to scale\n\nsx, sy: Scaling factors along the X- and Y-axes. A scaling\nfactor of 1.0 will not cause any scaling along the relevant\naxis.\n\nReturns m (updated)."]
    pub fn fz_post_scale(m: fz_matrix, sx: f32, sy: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Create a shearing matrix.\n\nThe returned matrix is of the form [ 1 sy sx 1 0 0 ].\n\nm: pointer to place to store returned matrix\n\nsx, sy: Shearing factors. A shearing factor of 0.0 will not\ncause any shearing along the relevant axis.\n\nReturns m."]
    pub fn fz_shear(sx: f32, sy: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Premultiply a matrix with a shearing matrix.\n\nThe shearing matrix is of the form [ 1 sy sx 1 0 0 ].\n\nm: pointer to matrix to premultiply\n\nsx, sy: Shearing factors. A shearing factor of 0.0 will not\ncause any shearing along the relevant axis.\n\nReturns m (updated)."]
    pub fn fz_pre_shear(m: fz_matrix, sx: f32, sy: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Create a rotation matrix.\n\nThe returned matrix is of the form\n[ cos(deg) sin(deg) -sin(deg) cos(deg) 0 0 ].\n\nm: Pointer to place to store matrix\n\ndegrees: Degrees of counter clockwise rotation. Values less\nthan zero and greater than 360 are handled as expected.\n\nReturns m."]
    pub fn fz_rotate(degrees: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Rotate a transformation by premultiplying.\n\nThe premultiplied matrix is of the form\n[ cos(deg) sin(deg) -sin(deg) cos(deg) 0 0 ].\n\nm: Pointer to matrix to premultiply.\n\ndegrees: Degrees of counter clockwise rotation. Values less\nthan zero and greater than 360 are handled as expected.\n\nReturns m (updated)."]
    pub fn fz_pre_rotate(m: fz_matrix, degrees: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Create a translation matrix.\n\nThe returned matrix is of the form [ 1 0 0 1 tx ty ].\n\nm: A place to store the created matrix.\n\ntx, ty: Translation distances along the X- and Y-axes. A\ntranslation of 0 will not cause any translation along the\nrelevant axis.\n\nReturns m."]
    pub fn fz_translate(tx: f32, ty: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Translate a matrix by premultiplication.\n\nm: The matrix to translate\n\ntx, ty: Translation distances along the X- and Y-axes. A\ntranslation of 0 will not cause any translation along the\nrelevant axis.\n\nReturns m."]
    pub fn fz_pre_translate(m: fz_matrix, tx: f32, ty: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Create transform matrix to draw page\nat a given resolution and rotation. Adjusts the scaling\nfactors so that the page covers whole number of\npixels and adjust the page origin to be at 0,0."]
    pub fn fz_transform_page(mediabox: fz_rect, resolution: f32, rotate: f32) -> fz_matrix;
}
extern "C" {
    #[doc = "Create an inverse matrix.\n\nmatrix: Matrix to invert. A degenerate matrix, where the\ndeterminant is equal to zero, can not be inverted and the\noriginal matrix is returned instead.\n\nReturns inverse."]
    pub fn fz_invert_matrix(matrix: fz_matrix) -> fz_matrix;
}
extern "C" {
    #[doc = "Attempt to create an inverse matrix.\n\ninv: Place to store inverse matrix.\n\nsrc: Matrix to invert. A degenerate matrix, where the\ndeterminant is equal to zero, can not be inverted.\n\nReturns 1 if matrix is degenerate (singular), or 0 otherwise."]
    pub fn fz_try_invert_matrix(inv: *mut fz_matrix, src: fz_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Check if a transformation is rectilinear.\n\nRectilinear means that no shearing is present and that any\nrotations present are a multiple of 90 degrees. Usually this\nis used to make sure that axis-aligned rectangles before the\ntransformation are still axis-aligned rectangles afterwards."]
    pub fn fz_is_rectilinear(m: fz_matrix) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Calculate average scaling factor of matrix."]
    pub fn fz_matrix_expansion(m: fz_matrix) -> f32;
}
extern "C" {
    #[doc = "Compute intersection of two rectangles.\n\nGiven two rectangles, update the first to be the smallest\naxis-aligned rectangle that covers the area covered by both\ngiven rectangles. If either rectangle is empty then the\nintersection is also empty. If either rectangle is infinite\nthen the intersection is simply the non-infinite rectangle.\nShould both rectangles be infinite, then the intersection is\nalso infinite."]
    pub fn fz_intersect_rect(a: fz_rect, b: fz_rect) -> fz_rect;
}
extern "C" {
    #[doc = "Compute intersection of two bounding boxes.\n\nSimilar to fz_intersect_rect but operates on two bounding\nboxes instead of two rectangles."]
    pub fn fz_intersect_irect(a: fz_irect, b: fz_irect) -> fz_irect;
}
extern "C" {
    #[doc = "Compute union of two rectangles.\n\nGiven two rectangles, update the first to be the smallest\naxis-aligned rectangle that encompasses both given rectangles.\nIf either rectangle is infinite then the union is also infinite.\nIf either rectangle is empty then the union is simply the\nnon-empty rectangle. Should both rectangles be empty, then the\nunion is also empty."]
    pub fn fz_union_rect(a: fz_rect, b: fz_rect) -> fz_rect;
}
extern "C" {
    #[doc = "Convert a rect into the minimal bounding box\nthat covers the rectangle.\n\nCoordinates in a bounding box are integers, so rounding of the\nrects coordinates takes place. The top left corner is rounded\nupwards and left while the bottom right corner is rounded\ndownwards and to the right."]
    pub fn fz_irect_from_rect(rect: fz_rect) -> fz_irect;
}
extern "C" {
    #[doc = "Round rectangle coordinates.\n\nCoordinates in a bounding box are integers, so rounding of the\nrects coordinates takes place. The top left corner is rounded\nupwards and left while the bottom right corner is rounded\ndownwards and to the right.\n\nThis differs from fz_irect_from_rect, in that fz_irect_from_rect\nslavishly follows the numbers (i.e any slight over/under\ncalculations can cause whole extra pixels to be added).\nfz_round_rect allows for a small amount of rounding error when\ncalculating the bbox."]
    pub fn fz_round_rect(rect: fz_rect) -> fz_irect;
}
extern "C" {
    #[doc = "Convert a bbox into a rect.\n\nFor our purposes, a rect can represent all the values we meet in\na bbox, so nothing can go wrong.\n\nrect: A place to store the generated rectangle.\n\nbbox: The bbox to convert.\n\nReturns rect (updated)."]
    pub fn fz_rect_from_irect(bbox: fz_irect) -> fz_rect;
}
extern "C" {
    #[doc = "Expand a bbox by a given amount in all directions."]
    pub fn fz_expand_rect(b: fz_rect, expand: f32) -> fz_rect;
}
extern "C" {
    pub fn fz_expand_irect(a: fz_irect, expand: ::std::os::raw::c_int) -> fz_irect;
}
extern "C" {
    #[doc = "Calculate the area of a rectangle.\n\nAlways non-negative. All invalid or empty rects return 0."]
    pub fn fz_rect_area(r: fz_rect) -> f32;
}
extern "C" {
    #[doc = "Expand a bbox to include a given point.\nTo create a rectangle that encompasses a sequence of points, the\nrectangle must first be set to be the empty rectangle at one of\nthe points before including the others."]
    pub fn fz_include_point_in_rect(r: fz_rect, p: fz_point) -> fz_rect;
}
extern "C" {
    #[doc = "Translate bounding box.\n\nTranslate a bbox by a given x and y offset. Allows for overflow."]
    pub fn fz_translate_rect(a: fz_rect, xoff: f32, yoff: f32) -> fz_rect;
}
extern "C" {
    pub fn fz_translate_irect(
        a: fz_irect,
        xoff: ::std::os::raw::c_int,
        yoff: ::std::os::raw::c_int,
    ) -> fz_irect;
}
extern "C" {
    #[doc = "Test rectangle inclusion.\n\nReturn true if a entirely contains b."]
    pub fn fz_contains_rect(a: fz_rect, b: fz_rect) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Test rectangle overlap.\n\nReturns true if the area of the overlap is\nnon zero."]
    pub fn fz_overlaps_rect(a: fz_rect, b: fz_rect) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Apply a transformation to a point.\n\ntransform: Transformation matrix to apply. See fz_concat,\nfz_scale, fz_rotate and fz_translate for how to create a\nmatrix.\n\npoint: Pointer to point to update.\n\nReturns transform (unchanged)."]
    pub fn fz_transform_point(point: fz_point, m: fz_matrix) -> fz_point;
}
extern "C" {
    pub fn fz_transform_point_xy(x: f32, y: f32, m: fz_matrix) -> fz_point;
}
extern "C" {
    #[doc = "Apply a transformation to a vector.\n\ntransform: Transformation matrix to apply. See fz_concat,\nfz_scale and fz_rotate for how to create a matrix. Any\ntranslation will be ignored.\n\nvector: Pointer to vector to update."]
    pub fn fz_transform_vector(vector: fz_point, m: fz_matrix) -> fz_point;
}
extern "C" {
    #[doc = "Apply a transform to a rectangle.\n\nAfter the four corner points of the axis-aligned rectangle\nhave been transformed it may not longer be axis-aligned. So a\nnew axis-aligned rectangle is created covering at least the\narea of the transformed rectangle.\n\ntransform: Transformation matrix to apply. See fz_concat,\nfz_scale and fz_rotate for how to create a matrix.\n\nrect: Rectangle to be transformed. The two special cases\nfz_empty_rect and fz_infinite_rect, may be used but are\nreturned unchanged as expected."]
    pub fn fz_transform_rect(rect: fz_rect, m: fz_matrix) -> fz_rect;
}
extern "C" {
    #[doc = "Normalize a vector to length one."]
    pub fn fz_normalize_vector(p: fz_point) -> fz_point;
}
extern "C" {
    #[doc = "Grid fit a matrix.\n\nas_tiled = 0 => adjust the matrix so that the image of the unit\nsquare completely covers any pixel that was touched by the\nimage of the unit square under the original matrix.\n\nas_tiled = 1 => adjust the matrix so that the corners of the\nimage of the unit square align with the closest integer corner\nof the image of the unit square under the original matrix."]
    pub fn fz_gridfit_matrix(as_tiled: ::std::os::raw::c_int, m: fz_matrix) -> fz_matrix;
}
extern "C" {
    #[doc = "Find the largest expansion performed by this matrix.\n(i.e. max(abs(m.a),abs(m.b),abs(m.c),abs(m.d))"]
    pub fn fz_matrix_max_expansion(m: fz_matrix) -> f32;
}
#[doc = "A representation for a region defined by 4 points.\n\nThe significant difference between quads and rects is that\nthe edges of quads are not axis aligned."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_quad {
    pub ul: fz_point,
    pub ur: fz_point,
    pub ll: fz_point,
    pub lr: fz_point,
}
#[test]
fn bindgen_test_layout_fz_quad() {
    const UNINIT: ::std::mem::MaybeUninit<fz_quad> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_quad>(),
        32usize,
        concat!("Size of: ", stringify!(fz_quad))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_quad>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_quad))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ul) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_quad),
            "::",
            stringify!(ul)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ur) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_quad),
            "::",
            stringify!(ur)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ll) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_quad),
            "::",
            stringify!(ll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_quad),
            "::",
            stringify!(lr)
        )
    );
}
extern "C" {
    #[doc = "Is a quad valid?"]
    pub fn fz_is_valid_quad(q: fz_quad) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Is a quad empty?"]
    pub fn fz_is_empty_quad(q: fz_quad) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Is a quad infinite?"]
    pub fn fz_is_infinite_quad(q: fz_quad) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Convert a rect to a quad (losslessly)."]
    pub fn fz_quad_from_rect(r: fz_rect) -> fz_quad;
}
extern "C" {
    #[doc = "Convert a quad to the smallest rect that covers it."]
    pub fn fz_rect_from_quad(q: fz_quad) -> fz_rect;
}
extern "C" {
    #[doc = "Transform a quad by a matrix."]
    pub fn fz_transform_quad(q: fz_quad, m: fz_matrix) -> fz_quad;
}
extern "C" {
    #[doc = "Inclusion test for quads."]
    pub fn fz_is_point_inside_quad(p: fz_point, q: fz_quad) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Inclusion test for rects. (Rect is assumed to be open, i.e.\ntop right corner is not included)."]
    pub fn fz_is_point_inside_rect(p: fz_point, r: fz_rect) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Inclusion test for irects. (Rect is assumed to be open, i.e.\ntop right corner is not included)."]
    pub fn fz_is_point_inside_irect(
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        r: fz_irect,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Inclusion test for rects.\n\nrects are assumed to be both open or both closed.\n\nNo invalid rect can include any other rect.\nNo invalid rect can be included by any rect.\nEmpty (point) rects can include themselves.\nEmpty (line) rects can include many (subline) rects."]
    pub fn fz_is_rect_inside_rect(inner: fz_rect, outer: fz_rect) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Inclusion test for irects.\n\nrects are assumed to be both open or both closed.\n\nNo invalid rect can include any other rect.\nNo invalid rect can be included by any rect.\nEmpty (point) rects can include themselves.\nEmpty (line) rects can include many (subline) rects."]
    pub fn fz_is_irect_inside_irect(inner: fz_irect, outer: fz_irect) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Inclusion test for quad in quad.\n\nThis may break down if quads are not 'well formed'."]
    pub fn fz_is_quad_inside_quad(needle: fz_quad, haystack: fz_quad) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Intersection test for quads.\n\nThis may break down if quads are not 'well formed'."]
    pub fn fz_is_quad_intersecting_quad(a: fz_quad, b: fz_quad) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_ckd_size_from_i64(out: *mut usize, in_: i64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_ckd_int_from_i64(out: *mut ::std::os::raw::c_int, in_: i64) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_font_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_hyph_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_colorspace_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_style_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_tuning_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_glyph_cache {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_document_handler_context {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_archive_handler_context {
    _unused: [u8; 0],
}
#[doc = "Allocator structure; holds callbacks and private data pointer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_alloc_context {
    pub user: *mut ::std::os::raw::c_void,
    pub malloc: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_void,
            arg3: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub free: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: *mut ::std::os::raw::c_void),
    >,
}
#[test]
fn bindgen_test_layout_fz_alloc_context() {
    const UNINIT: ::std::mem::MaybeUninit<fz_alloc_context> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_alloc_context>(),
        32usize,
        concat!("Size of: ", stringify!(fz_alloc_context))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_alloc_context>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_alloc_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_alloc_context),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).malloc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_alloc_context),
            "::",
            stringify!(malloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).realloc) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_alloc_context),
            "::",
            stringify!(realloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_alloc_context),
            "::",
            stringify!(free)
        )
    );
}
extern "C" {
    #[doc = "Throw an exception.\n\nThis assumes an enclosing fz_try() block within the callstack."]
    pub fn fz_vthrow(
        ctx: *mut fz_context,
        errcode: ::std::os::raw::c_int,
        arg1: *const ::std::os::raw::c_char,
        ap: va_list,
    ) -> !;
}
extern "C" {
    pub fn fz_throw(
        ctx: *mut fz_context,
        errcode: ::std::os::raw::c_int,
        arg1: *const ::std::os::raw::c_char,
        ...
    ) -> !;
}
extern "C" {
    pub fn fz_rethrow(ctx: *mut fz_context) -> !;
}
extern "C" {
    #[doc = "Called within a catch block this modifies the current\nexception's code. If it's of type 'fromcode' it is\nmodified to 'tocode'. Typically used for 'downgrading'\nexception severity."]
    pub fn fz_morph_error(
        ctx: *mut fz_context,
        fromcode: ::std::os::raw::c_int,
        tocode: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Log a warning.\n\nThis goes to the registered warning stream (stderr by\ndefault)."]
    pub fn fz_vwarn(ctx: *mut fz_context, fmt: *const ::std::os::raw::c_char, ap: va_list);
}
extern "C" {
    pub fn fz_warn(ctx: *mut fz_context, fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[doc = "Within an fz_catch() block, retrieve the formatted message\nstring for the current exception.\n\nThis assumes no intervening use of fz_try/fz_catch."]
    pub fn fz_caught_message(ctx: *mut fz_context) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Within an fz_catch() block, retrieve the error code for\nthe current exception.\n\nThis assumes no intervening use of fz_try/fz_catch."]
    pub fn fz_caught(ctx: *mut fz_context) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_caught_errno(ctx: *mut fz_context) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Within an fz_catch() block, rethrow the current exception\nif the errcode of the current exception matches.\n\nThis assumes no intervening use of fz_try/fz_catch."]
    pub fn fz_rethrow_if(ctx: *mut fz_context, errcode: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_rethrow_unless(ctx: *mut fz_context, errcode: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = "Format an error message, and log it to the registered\nerror stream (stderr by default)."]
    pub fn fz_log_error_printf(ctx: *mut fz_context, fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn fz_vlog_error_printf(
        ctx: *mut fz_context,
        fmt: *const ::std::os::raw::c_char,
        ap: va_list,
    );
}
extern "C" {
    #[doc = "Log a (preformatted) string to the registered\nerror stream (stderr by default)."]
    pub fn fz_log_error(ctx: *mut fz_context, str_: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fz_report_error(ctx: *mut fz_context);
}
extern "C" {
    pub fn fz_ignore_error(ctx: *mut fz_context);
}
extern "C" {
    pub fn fz_convert_error(
        ctx: *mut fz_context,
        code: *mut ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
pub const fz_error_type_FZ_ERROR_NONE: fz_error_type = 0;
pub const fz_error_type_FZ_ERROR_GENERIC: fz_error_type = 1;
pub const fz_error_type_FZ_ERROR_SYSTEM: fz_error_type = 2;
pub const fz_error_type_FZ_ERROR_LIBRARY: fz_error_type = 3;
pub const fz_error_type_FZ_ERROR_ARGUMENT: fz_error_type = 4;
pub const fz_error_type_FZ_ERROR_LIMIT: fz_error_type = 5;
pub const fz_error_type_FZ_ERROR_UNSUPPORTED: fz_error_type = 6;
pub const fz_error_type_FZ_ERROR_FORMAT: fz_error_type = 7;
pub const fz_error_type_FZ_ERROR_SYNTAX: fz_error_type = 8;
pub const fz_error_type_FZ_ERROR_TRYLATER: fz_error_type = 9;
pub const fz_error_type_FZ_ERROR_ABORT: fz_error_type = 10;
pub const fz_error_type_FZ_ERROR_REPAIRED: fz_error_type = 11;
pub type fz_error_type = ::std::os::raw::c_uint;
extern "C" {
    #[doc = "Flush any repeated warnings.\n\nRepeated warnings are buffered, counted and eventually printed\nalong with the number of repetitions. Call fz_flush_warnings\nto force printing of the latest buffered warning and the\nnumber of repetitions, for example to make sure that all\nwarnings are printed before exiting an application."]
    pub fn fz_flush_warnings(ctx: *mut fz_context);
}
#[doc = "Locking functions\n\nMuPDF is kept deliberately free of any knowledge of particular\nthreading systems. As such, in order for safe multi-threaded\noperation, we rely on callbacks to client provided functions.\n\nA client is expected to provide FZ_LOCK_MAX number of mutexes,\nand a function to lock/unlock each of them. These may be\nrecursive mutexes, but do not have to be.\n\nIf a client does not intend to use multiple threads, then it\nmay pass NULL instead of a lock structure.\n\nIn order to avoid deadlocks, we have one simple rule\ninternally as to how we use locks: We can never take lock n\nwhen we already hold any lock i, where 0 <= i <= n. In order\nto verify this, we have some debugging code, that can be\nenabled by defining FITZ_DEBUG_LOCKING."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_locks_context {
    pub user: *mut ::std::os::raw::c_void,
    pub lock: ::std::option::Option<
        unsafe extern "C" fn(user: *mut ::std::os::raw::c_void, lock: ::std::os::raw::c_int),
    >,
    pub unlock: ::std::option::Option<
        unsafe extern "C" fn(user: *mut ::std::os::raw::c_void, lock: ::std::os::raw::c_int),
    >,
}
#[test]
fn bindgen_test_layout_fz_locks_context() {
    const UNINIT: ::std::mem::MaybeUninit<fz_locks_context> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_locks_context>(),
        24usize,
        concat!("Size of: ", stringify!(fz_locks_context))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_locks_context>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_locks_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_locks_context),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_locks_context),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unlock) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_locks_context),
            "::",
            stringify!(unlock)
        )
    );
}
pub const FZ_LOCK_ALLOC: _bindgen_ty_1 = 0;
pub const FZ_LOCK_FREETYPE: _bindgen_ty_1 = 1;
pub const FZ_LOCK_GLYPHCACHE: _bindgen_ty_1 = 2;
pub const FZ_LOCK_MAX: _bindgen_ty_1 = 3;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
extern "C" {
    pub fn fz_assert_lock_held(ctx: *mut fz_context, lock: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_assert_lock_not_held(ctx: *mut fz_context, lock: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_lock_debug_lock(ctx: *mut fz_context, lock: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_lock_debug_unlock(ctx: *mut fz_context, lock: ::std::os::raw::c_int);
}
pub const FZ_STORE_UNLIMITED: _bindgen_ty_2 = 0;
pub const FZ_STORE_DEFAULT: _bindgen_ty_2 = 268435456;
#[doc = "Specifies the maximum size in bytes of the resource store in\nfz_context. Given as argument to fz_new_context.\n\nFZ_STORE_UNLIMITED: Let resource store grow unbounded.\n\nFZ_STORE_DEFAULT: A reasonable upper bound on the size, for\ndevices that are not memory constrained."]
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
extern "C" {
    #[doc = "Make a clone of an existing context.\n\nThis function is meant to be used in multi-threaded\napplications where each thread requires its own context, yet\nparts of the global state, for example caching, are shared.\n\nctx: Context obtained from fz_new_context to make a copy of.\nctx must have had locks and lock/functions setup when created.\nThe two contexts will share the memory allocator, resource\nstore, locks and lock/unlock functions. They will each have\ntheir own exception stacks though.\n\nMay return NULL."]
    pub fn fz_clone_context(ctx: *mut fz_context) -> *mut fz_context;
}
extern "C" {
    #[doc = "Free a context and its global state.\n\nThe context and all of its global state is freed, and any\nbuffered warnings are flushed (see fz_flush_warnings). If NULL\nis passed in nothing will happen.\n\nMust not be called for a context that is being used in an active\nfz_try(), fz_always() or fz_catch() block."]
    pub fn fz_drop_context(ctx: *mut fz_context);
}
extern "C" {
    #[doc = "Set the user field in the context.\n\nNULL initially, this field can be set to any opaque value\nrequired by the user. It is copied on clones."]
    pub fn fz_set_user_context(ctx: *mut fz_context, user: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = "Read the user field from the context."]
    pub fn fz_user_context(ctx: *mut fz_context) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "FIXME: Better not to expose fz_default_error_callback, and\nfz_default_warning callback and to allow 'NULL' to be used\nint fz_set_xxxx_callback to mean \"defaults\".\n\nFIXME: Do we need/want functions like\nfz_error_callback(ctx, message) to allow callers to inject\nstuff into the error/warning streams?\n/\n/**\nThe default error callback. Declared publicly just so that the\nerror callback can be set back to this after it has been\noverridden."]
    pub fn fz_default_error_callback(
        user: *mut ::std::os::raw::c_void,
        message: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "The default warning callback. Declared publicly just so that\nthe warning callback can be set back to this after it has been\noverridden."]
    pub fn fz_default_warning_callback(
        user: *mut ::std::os::raw::c_void,
        message: *const ::std::os::raw::c_char,
    );
}
#[doc = "A callback called whenever an error message is generated.\nThe user pointer passed to fz_set_error_callback() is passed\nalong with the error message."]
pub type fz_error_cb = ::std::option::Option<
    unsafe extern "C" fn(user: *mut ::std::os::raw::c_void, message: *const ::std::os::raw::c_char),
>;
#[doc = "A callback called whenever a warning message is generated.\nThe user pointer passed to fz_set_warning_callback() is\npassed along with the warning message."]
pub type fz_warning_cb = ::std::option::Option<
    unsafe extern "C" fn(user: *mut ::std::os::raw::c_void, message: *const ::std::os::raw::c_char),
>;
extern "C" {
    #[doc = "Set the error callback. This will be called as part of the\nexception handling.\n\nThe callback must not throw exceptions!"]
    pub fn fz_set_error_callback(
        ctx: *mut fz_context,
        error_cb: fz_error_cb,
        user: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = "Retrieve the currently set error callback, or NULL if none\nhas been set. Optionally, if user is non-NULL, the user pointer\ngiven when the warning callback was set is also passed back to\nthe caller."]
    pub fn fz_error_callback(
        ctx: *mut fz_context,
        user: *mut *mut ::std::os::raw::c_void,
    ) -> fz_error_cb;
}
extern "C" {
    #[doc = "Set the warning callback. This will be called as part of the\nexception handling.\n\nThe callback must not throw exceptions!"]
    pub fn fz_set_warning_callback(
        ctx: *mut fz_context,
        warning_cb: fz_warning_cb,
        user: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = "Retrieve the currently set warning callback, or NULL if none\nhas been set. Optionally, if user is non-NULL, the user pointer\ngiven when the warning callback was set is also passed back to\nthe caller."]
    pub fn fz_warning_callback(
        ctx: *mut fz_context,
        user: *mut *mut ::std::os::raw::c_void,
    ) -> fz_warning_cb;
}
#[doc = "Given the width and height of an image,\nthe subsample factor, and the subarea of the image actually\nrequired, the caller can decide whether to decode the whole\nimage or just a subarea.\n\narg: The caller supplied opaque argument.\n\nw, h: The width/height of the complete image.\n\nl2factor: The log2 factor for subsampling (i.e. image will be\ndecoded to (w>>l2factor, h>>l2factor)).\n\nsubarea: The actual subarea required for the current operation.\nThe tuning function is allowed to increase this in size if\nrequired."]
pub type fz_tune_image_decode_fn = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        w: ::std::os::raw::c_int,
        h: ::std::os::raw::c_int,
        l2factor: ::std::os::raw::c_int,
        subarea: *mut fz_irect,
    ),
>;
#[doc = "Given the source width and height of\nimage, together with the actual required width and height,\ndecide whether we should use mitchell scaling.\n\narg: The caller supplied opaque argument.\n\ndst_w, dst_h: The actual width/height required on the target\ndevice.\n\nsrc_w, src_h: The source width/height of the image.\n\nReturn 0 not to use the Mitchell scaler, 1 to use the Mitchell\nscaler. All other values reserved."]
pub type fz_tune_image_scale_fn = ::std::option::Option<
    unsafe extern "C" fn(
        arg: *mut ::std::os::raw::c_void,
        dst_w: ::std::os::raw::c_int,
        dst_h: ::std::os::raw::c_int,
        src_w: ::std::os::raw::c_int,
        src_h: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = "Set the tuning function to use for\nimage decode.\n\nimage_decode: Function to use.\n\narg: Opaque argument to be passed to tuning function."]
    pub fn fz_tune_image_decode(
        ctx: *mut fz_context,
        image_decode: fz_tune_image_decode_fn,
        arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = "Set the tuning function to use for\nimage scaling.\n\nimage_scale: Function to use.\n\narg: Opaque argument to be passed to tuning function."]
    pub fn fz_tune_image_scale(
        ctx: *mut fz_context,
        image_scale: fz_tune_image_scale_fn,
        arg: *mut ::std::os::raw::c_void,
    );
}
pub const FZ_IMAGE_RENDERING_BALANCE: _bindgen_ty_3 = 0;
pub const FZ_IMAGE_RENDERING_QUALITY: _bindgen_ty_3 = 1;
pub const FZ_IMAGE_RENDERING_SPEED: _bindgen_ty_3 = 2;
#[doc = "Set the behavior for image rendering and resampling."]
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    pub fn fz_tune_image_rendering(ctx: *mut fz_context, behavior: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = "Get the number of bits of antialiasing we are\nusing (for graphics). Between 0 and 8."]
    pub fn fz_aa_level(ctx: *mut fz_context) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Set the number of bits of antialiasing we should\nuse (for both text and graphics).\n\nbits: The number of bits of antialiasing to use (values are\nclamped to within the 0 to 8 range)."]
    pub fn fz_set_aa_level(ctx: *mut fz_context, bits: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = "Get the number of bits of antialiasing we are\nusing for text. Between 0 and 8."]
    pub fn fz_text_aa_level(ctx: *mut fz_context) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Set the number of bits of antialiasing we\nshould use for text.\n\nbits: The number of bits of antialiasing to use (values are\nclamped to within the 0 to 8 range)."]
    pub fn fz_set_text_aa_level(ctx: *mut fz_context, bits: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = "Get the number of bits of antialiasing we are\nusing for graphics. Between 0 and 8."]
    pub fn fz_graphics_aa_level(ctx: *mut fz_context) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Set the number of bits of antialiasing we\nshould use for graphics.\n\nbits: The number of bits of antialiasing to use (values are\nclamped to within the 0 to 8 range)."]
    pub fn fz_set_graphics_aa_level(ctx: *mut fz_context, bits: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = "Get the minimum line width to be\nused for stroked lines.\n\nmin_line_width: The minimum line width to use (in pixels)."]
    pub fn fz_graphics_min_line_width(ctx: *mut fz_context) -> f32;
}
extern "C" {
    #[doc = "Set the minimum line width to be\nused for stroked lines.\n\nmin_line_width: The minimum line width to use (in pixels)."]
    pub fn fz_set_graphics_min_line_width(ctx: *mut fz_context, min_line_width: f32);
}
extern "C" {
    #[doc = "Get the user stylesheet source text."]
    pub fn fz_user_css(ctx: *mut fz_context) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Set the user stylesheet source text for use with HTML and EPUB."]
    pub fn fz_set_user_css(ctx: *mut fz_context, text: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = "Set the user stylesheet by loading the source from a file.\nIf the file is missing, do nothing."]
    pub fn fz_load_user_css(ctx: *mut fz_context, filename: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = "Return whether to respect document styles in HTML and EPUB."]
    pub fn fz_use_document_css(ctx: *mut fz_context) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Toggle whether to respect document styles in HTML and EPUB."]
    pub fn fz_set_use_document_css(ctx: *mut fz_context, use_: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = "Enable icc profile based operation."]
    pub fn fz_enable_icc(ctx: *mut fz_context);
}
extern "C" {
    #[doc = "Disable icc profile based operation."]
    pub fn fz_disable_icc(ctx: *mut fz_context);
}
extern "C" {
    pub fn fz_malloc_array_imp(
        ctx: *mut fz_context,
        nmemb: usize,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn fz_realloc_array_imp(
        ctx: *mut fz_context,
        p: *mut ::std::os::raw::c_void,
        nmemb: usize,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Allocate uninitialized memory of a given size.\nDoes NOT clear the memory!\n\nMay return NULL for size = 0.\n\nThrows exception in the event of failure to allocate."]
    pub fn fz_malloc(ctx: *mut fz_context, size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Allocate array of memory of count entries of size bytes.\nClears the memory to zero.\n\nThrows exception in the event of failure to allocate."]
    pub fn fz_calloc(
        ctx: *mut fz_context,
        count: usize,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Reallocates a block of memory to given size. Existing contents\nup to min(old_size,new_size) are maintained. The rest of the\nblock is uninitialised.\n\nfz_realloc(ctx, NULL, size) behaves like fz_malloc(ctx, size).\n\nfz_realloc(ctx, p, 0); behaves like fz_free(ctx, p).\n\nThrows exception in the event of failure to allocate."]
    pub fn fz_realloc(
        ctx: *mut fz_context,
        p: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Free a previously allocated block of memory.\n\nfz_free(ctx, NULL) does nothing.\n\nNever throws exceptions."]
    pub fn fz_free(ctx: *mut fz_context, p: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = "fz_malloc equivalent that returns NULL rather than throwing\nexceptions."]
    pub fn fz_malloc_no_throw(ctx: *mut fz_context, size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "fz_calloc equivalent that returns NULL rather than throwing\nexceptions."]
    pub fn fz_calloc_no_throw(
        ctx: *mut fz_context,
        count: usize,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "fz_realloc equivalent that returns NULL rather than throwing\nexceptions."]
    pub fn fz_realloc_no_throw(
        ctx: *mut fz_context,
        p: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "fz_malloc equivalent, except that the block is guaranteed aligned.\nBlock must be freed later using fz_free_aligned."]
    pub fn fz_malloc_aligned(
        ctx: *mut fz_context,
        size: usize,
        align: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "fz_free equivalent, for blocks allocated via fz_malloc_aligned."]
    pub fn fz_free_aligned(ctx: *mut fz_context, p: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = "Portable strdup implementation, using fz allocators."]
    pub fn fz_strdup(
        ctx: *mut fz_context,
        s: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Fill block with len bytes of pseudo-randomness."]
    pub fn fz_memrnd(ctx: *mut fz_context, block: *mut u8, len: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug)]
pub struct fz_string {
    pub refs: ::std::os::raw::c_int,
    pub str_: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_fz_string() {
    const UNINIT: ::std::mem::MaybeUninit<fz_string> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_string>(),
        4usize,
        concat!("Size of: ", stringify!(fz_string))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_string>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_string))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_string),
            "::",
            stringify!(refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_string),
            "::",
            stringify!(str_)
        )
    );
}
extern "C" {
    pub fn fz_new_string(
        ctx: *mut fz_context,
        str_: *const ::std::os::raw::c_char,
    ) -> *mut fz_string;
}
extern "C" {
    pub fn fz_keep_string(ctx: *mut fz_context, str_: *mut fz_string) -> *mut fz_string;
}
extern "C" {
    pub fn fz_drop_string(ctx: *mut fz_context, str_: *mut fz_string);
}
extern "C" {
    pub fn fz_var_imp(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn fz_push_try(ctx: *mut fz_context) -> *mut fz_jmp_buf;
}
extern "C" {
    pub fn fz_do_try(ctx: *mut fz_context) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_do_always(ctx: *mut fz_context) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_do_catch(ctx: *mut fz_context) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_error_stack_slot {
    pub buffer: fz_jmp_buf,
    pub state: ::std::os::raw::c_int,
    pub code: ::std::os::raw::c_int,
    pub padding: [::std::os::raw::c_char; 24usize],
}
#[test]
fn bindgen_test_layout_fz_error_stack_slot() {
    const UNINIT: ::std::mem::MaybeUninit<fz_error_stack_slot> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_error_stack_slot>(),
        228usize,
        concat!("Size of: ", stringify!(fz_error_stack_slot))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_error_stack_slot>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_error_stack_slot))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_stack_slot),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_stack_slot),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_stack_slot),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_stack_slot),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_error_context {
    pub top: *mut fz_error_stack_slot,
    pub stack: [fz_error_stack_slot; 256usize],
    pub padding: fz_error_stack_slot,
    pub stack_base: *mut fz_error_stack_slot,
    pub errcode: ::std::os::raw::c_int,
    pub errnum: ::std::os::raw::c_int,
    pub print_user: *mut ::std::os::raw::c_void,
    pub print: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut ::std::os::raw::c_void,
            message: *const ::std::os::raw::c_char,
        ),
    >,
    pub message: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_fz_error_context() {
    const UNINIT: ::std::mem::MaybeUninit<fz_error_context> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_error_context>(),
        58896usize,
        concat!("Size of: ", stringify!(fz_error_context))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_error_context>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_error_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).top) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_context),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_context),
            "::",
            stringify!(stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        58376usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_context),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stack_base) as usize - ptr as usize },
        58608usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_context),
            "::",
            stringify!(stack_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).errcode) as usize - ptr as usize },
        58616usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_context),
            "::",
            stringify!(errcode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).errnum) as usize - ptr as usize },
        58620usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_context),
            "::",
            stringify!(errnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).print_user) as usize - ptr as usize },
        58624usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_context),
            "::",
            stringify!(print_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).print) as usize - ptr as usize },
        58632usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_context),
            "::",
            stringify!(print)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize },
        58640usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_error_context),
            "::",
            stringify!(message)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_warn_context {
    pub print_user: *mut ::std::os::raw::c_void,
    pub print: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut ::std::os::raw::c_void,
            message: *const ::std::os::raw::c_char,
        ),
    >,
    pub count: ::std::os::raw::c_int,
    pub message: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_fz_warn_context() {
    const UNINIT: ::std::mem::MaybeUninit<fz_warn_context> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_warn_context>(),
        280usize,
        concat!("Size of: ", stringify!(fz_warn_context))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_warn_context>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_warn_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).print_user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_warn_context),
            "::",
            stringify!(print_user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).print) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_warn_context),
            "::",
            stringify!(print)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_warn_context),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_warn_context),
            "::",
            stringify!(message)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_aa_context {
    pub hscale: ::std::os::raw::c_int,
    pub vscale: ::std::os::raw::c_int,
    pub scale: ::std::os::raw::c_int,
    pub bits: ::std::os::raw::c_int,
    pub text_bits: ::std::os::raw::c_int,
    pub min_line_width: f32,
}
#[test]
fn bindgen_test_layout_fz_aa_context() {
    const UNINIT: ::std::mem::MaybeUninit<fz_aa_context> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_aa_context>(),
        24usize,
        concat!("Size of: ", stringify!(fz_aa_context))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_aa_context>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_aa_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hscale) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_aa_context),
            "::",
            stringify!(hscale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vscale) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_aa_context),
            "::",
            stringify!(vscale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_aa_context),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bits) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_aa_context),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text_bits) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_aa_context),
            "::",
            stringify!(text_bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_line_width) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_aa_context),
            "::",
            stringify!(min_line_width)
        )
    );
}
pub const fz_activity_reason_FZ_ACTIVITY_NEW_DOC: fz_activity_reason = 0;
pub const fz_activity_reason_FZ_ACTIVITY_SHUTDOWN: fz_activity_reason = 1;
pub type fz_activity_reason = ::std::os::raw::c_uint;
pub type fz_activity_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        opaque: *mut ::std::os::raw::c_void,
        reason: fz_activity_reason,
        reason_arg: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_activity_context {
    pub opaque: *mut ::std::os::raw::c_void,
    pub activity: fz_activity_fn,
}
#[test]
fn bindgen_test_layout_fz_activity_context() {
    const UNINIT: ::std::mem::MaybeUninit<fz_activity_context> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_activity_context>(),
        16usize,
        concat!("Size of: ", stringify!(fz_activity_context))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_activity_context>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_activity_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opaque) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_activity_context),
            "::",
            stringify!(opaque)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).activity) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_activity_context),
            "::",
            stringify!(activity)
        )
    );
}
extern "C" {
    pub fn fz_register_activity_logger(
        ctx: *mut fz_context,
        activity: fz_activity_fn,
        opaque: *mut ::std::os::raw::c_void,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_context {
    pub user: *mut ::std::os::raw::c_void,
    pub master: *mut fz_context,
    pub context_count: ::std::os::raw::c_int,
    pub next_document_id: ::std::os::raw::c_int,
    pub alloc: fz_alloc_context,
    pub locks: fz_locks_context,
    pub error: fz_error_context,
    pub warn: fz_warn_context,
    pub activity: fz_activity_context,
    pub aa: fz_aa_context,
    pub seed48: [u16; 7usize],
    pub icc_enabled: ::std::os::raw::c_int,
    pub handler: *mut fz_document_handler_context,
    pub archive: *mut fz_archive_handler_context,
    pub style: *mut fz_style_context,
    pub tuning: *mut fz_tuning_context,
    pub stddbg: *mut fz_output,
    pub font: *mut fz_font_context,
    pub hyph: *mut fz_hyph_context,
    pub colorspace: *mut fz_colorspace_context,
    pub store: *mut fz_store,
    pub glyph_cache: *mut fz_glyph_cache,
}
#[test]
fn bindgen_test_layout_fz_context() {
    const UNINIT: ::std::mem::MaybeUninit<fz_context> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_context>(),
        59400usize,
        concat!("Size of: ", stringify!(fz_context))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_context>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_context))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).master) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(master)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context_count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(context_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next_document_id) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(next_document_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alloc) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locks) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(locks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).warn) as usize - ptr as usize },
        58976usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(warn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).activity) as usize - ptr as usize },
        59256usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(activity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aa) as usize - ptr as usize },
        59272usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(aa)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seed48) as usize - ptr as usize },
        59296usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(seed48)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icc_enabled) as usize - ptr as usize },
        59312usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(icc_enabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handler) as usize - ptr as usize },
        59320usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).archive) as usize - ptr as usize },
        59328usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(archive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).style) as usize - ptr as usize },
        59336usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tuning) as usize - ptr as usize },
        59344usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(tuning)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stddbg) as usize - ptr as usize },
        59352usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(stddbg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).font) as usize - ptr as usize },
        59360usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(font)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hyph) as usize - ptr as usize },
        59368usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(hyph)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorspace) as usize - ptr as usize },
        59376usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(colorspace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).store) as usize - ptr as usize },
        59384usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(store)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).glyph_cache) as usize - ptr as usize },
        59392usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_context),
            "::",
            stringify!(glyph_cache)
        )
    );
}
extern "C" {
    pub fn fz_new_context_imp(
        alloc: *const fz_alloc_context,
        locks: *const fz_locks_context,
        max_store: usize,
        version: *const ::std::os::raw::c_char,
    ) -> *mut fz_context;
}
#[doc = "fz_buffer is a wrapper around a dynamically allocated array of\nbytes.\n\nBuffers have a capacity (the number of bytes storage immediately\navailable) and a current size.\n\nThe contents of the structure are considered implementation\ndetails and are subject to change. Users should use the accessor\nfunctions in preference."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_buffer {
    pub refs: ::std::os::raw::c_int,
    pub data: *mut ::std::os::raw::c_uchar,
    pub cap: usize,
    pub len: usize,
    pub unused_bits: ::std::os::raw::c_int,
    pub shared: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_fz_buffer() {
    const UNINIT: ::std::mem::MaybeUninit<fz_buffer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_buffer>(),
        40usize,
        concat!("Size of: ", stringify!(fz_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_buffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_buffer),
            "::",
            stringify!(refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_buffer),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cap) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_buffer),
            "::",
            stringify!(cap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_buffer),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused_bits) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_buffer),
            "::",
            stringify!(unused_bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shared) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_buffer),
            "::",
            stringify!(shared)
        )
    );
}
extern "C" {
    #[doc = "Take an additional reference to the buffer. The same pointer\nis returned.\n\nNever throws exceptions."]
    pub fn fz_keep_buffer(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Drop a reference to the buffer. When the reference count reaches\nzero, the buffer is destroyed.\n\nNever throws exceptions."]
    pub fn fz_drop_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
extern "C" {
    #[doc = "Retrieve internal memory of buffer.\n\ndatap: Output parameter that will be pointed to the data.\n\nReturns the current size of the data in bytes."]
    pub fn fz_buffer_storage(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        datap: *mut *mut ::std::os::raw::c_uchar,
    ) -> usize;
}
extern "C" {
    #[doc = "Ensure that a buffer's data ends in a\n0 byte, and return a pointer to it."]
    pub fn fz_string_from_buffer(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fz_new_buffer(ctx: *mut fz_context, capacity: usize) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Create a new buffer with existing data.\n\ndata: Pointer to existing data.\nsize: Size of existing data.\n\nTakes ownership of data. Does not make a copy. Calls fz_free on\nthe data when the buffer is deallocated. Do not use 'data' after\npassing to this function.\n\nReturns pointer to new buffer. Throws exception on allocation\nfailure."]
    pub fn fz_new_buffer_from_data(
        ctx: *mut fz_context,
        data: *mut ::std::os::raw::c_uchar,
        size: usize,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Like fz_new_buffer, but does not take ownership."]
    pub fn fz_new_buffer_from_shared_data(
        ctx: *mut fz_context,
        data: *const ::std::os::raw::c_uchar,
        size: usize,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Create a new buffer containing a copy of the passed data."]
    pub fn fz_new_buffer_from_copied_data(
        ctx: *mut fz_context,
        data: *const ::std::os::raw::c_uchar,
        size: usize,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Create a new buffer with printf formatted data."]
    pub fn fz_new_buffer_from_printf(
        ctx: *mut fz_context,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Make a new buffer, containing a copy of the data used in\nthe original."]
    pub fn fz_clone_buffer(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Create a new buffer with data decoded from a base64 input string."]
    pub fn fz_new_buffer_from_base64(
        ctx: *mut fz_context,
        data: *const ::std::os::raw::c_char,
        size: usize,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Ensure that a buffer has a given capacity,\ntruncating data if required.\n\ncapacity: The desired capacity for the buffer. If the current\nsize of the buffer contents is smaller than capacity, it is\ntruncated."]
    pub fn fz_resize_buffer(ctx: *mut fz_context, buf: *mut fz_buffer, capacity: usize);
}
extern "C" {
    #[doc = "Make some space within a buffer (i.e. ensure that\ncapacity > size)."]
    pub fn fz_grow_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
extern "C" {
    #[doc = "Trim wasted capacity from a buffer by resizing internal memory."]
    pub fn fz_trim_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
extern "C" {
    #[doc = "Empties the buffer. Storage is not freed, but is held ready\nto be reused as the buffer is refilled.\n\nNever throws exceptions."]
    pub fn fz_clear_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
extern "C" {
    #[doc = "Create a new buffer with a (subset of) the data from the buffer.\n\nstart: if >= 0, offset from start of buffer, if < 0 offset from end of buffer.\n\nend: if >= 0, offset from start of buffer, if < 0 offset from end of buffer."]
    pub fn fz_slice_buffer(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        start: i64,
        end: i64,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Append the contents of the source buffer onto the end of the\ndestination buffer, extending automatically as required.\n\nOwnership of buffers does not change."]
    pub fn fz_append_buffer(
        ctx: *mut fz_context,
        destination: *mut fz_buffer,
        source: *mut fz_buffer,
    );
}
extern "C" {
    #[doc = "Write a base64 encoded data block, optionally with periodic newlines."]
    pub fn fz_append_base64(
        ctx: *mut fz_context,
        out: *mut fz_buffer,
        data: *const ::std::os::raw::c_uchar,
        size: usize,
        newline: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Append a base64 encoded fz_buffer, optionally with periodic newlines."]
    pub fn fz_append_base64_buffer(
        ctx: *mut fz_context,
        out: *mut fz_buffer,
        data: *mut fz_buffer,
        newline: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "fz_append_*: Append data to a buffer.\n\nThe buffer will automatically grow as required."]
    pub fn fz_append_data(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        data: *const ::std::os::raw::c_void,
        len: usize,
    );
}
extern "C" {
    pub fn fz_append_string(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        data: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn fz_append_byte(ctx: *mut fz_context, buf: *mut fz_buffer, c: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_append_rune(ctx: *mut fz_context, buf: *mut fz_buffer, c: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_append_uint32_le(ctx: *mut fz_context, buf: *mut fz_buffer, x: u32);
}
extern "C" {
    pub fn fz_append_uint16_le(ctx: *mut fz_context, buf: *mut fz_buffer, x: u16);
}
extern "C" {
    pub fn fz_append_uint32_be(ctx: *mut fz_context, buf: *mut fz_buffer, x: u32);
}
extern "C" {
    pub fn fz_append_uint16_be(ctx: *mut fz_context, buf: *mut fz_buffer, x: u16);
}
extern "C" {
    pub fn fz_append_int32_le(ctx: *mut fz_context, buf: *mut fz_buffer, x: i32);
}
extern "C" {
    pub fn fz_append_int16_le(ctx: *mut fz_context, buf: *mut fz_buffer, x: i16);
}
extern "C" {
    pub fn fz_append_int32_be(ctx: *mut fz_context, buf: *mut fz_buffer, x: i32);
}
extern "C" {
    pub fn fz_append_int16_be(ctx: *mut fz_context, buf: *mut fz_buffer, x: i16);
}
extern "C" {
    pub fn fz_append_bits(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        value: ::std::os::raw::c_int,
        count: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn fz_append_bits_pad(ctx: *mut fz_context, buf: *mut fz_buffer);
}
extern "C" {
    #[doc = "fz_append_pdf_string: Append a string with PDF syntax quotes and\nescapes.\n\nThe buffer will automatically grow as required."]
    pub fn fz_append_pdf_string(
        ctx: *mut fz_context,
        buffer: *mut fz_buffer,
        text: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "fz_append_printf: Format and append data to buffer using\nprintf-like formatting (see fz_vsnprintf).\n\nThe buffer will automatically grow as required."]
    pub fn fz_append_printf(
        ctx: *mut fz_context,
        buffer: *mut fz_buffer,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    #[doc = "fz_append_vprintf: Format and append data to buffer using\nprintf-like formatting with varargs (see fz_vsnprintf)."]
    pub fn fz_append_vprintf(
        ctx: *mut fz_context,
        buffer: *mut fz_buffer,
        fmt: *const ::std::os::raw::c_char,
        args: va_list,
    );
}
extern "C" {
    #[doc = "Zero-terminate buffer in order to use as a C string.\n\nThis byte is invisible and does not affect the length of the\nbuffer as returned by fz_buffer_storage. The zero byte is\nwritten *after* the data, and subsequent writes will overwrite\nthe terminating byte.\n\nSubsequent changes to the size of the buffer (such as by\nfz_buffer_trim, fz_buffer_grow, fz_resize_buffer, etc) may\ninvalidate this."]
    pub fn fz_terminate_buffer(ctx: *mut fz_context, buf: *mut fz_buffer);
}
extern "C" {
    #[doc = "Create an MD5 digest from buffer contents.\n\nNever throws exceptions."]
    pub fn fz_md5_buffer(
        ctx: *mut fz_context,
        buffer: *mut fz_buffer,
        digest: *mut ::std::os::raw::c_uchar,
    );
}
extern "C" {
    #[doc = "Take ownership of buffer contents.\n\nPerforms the same task as fz_buffer_storage, but ownership of\nthe data buffer returns with this call. The buffer is left\nempty.\n\nNote: Bad things may happen if this is called on a buffer with\nmultiple references that is being used from multiple threads.\n\ndata: Pointer to place to retrieve data pointer.\n\nReturns length of stream."]
    pub fn fz_buffer_extract(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        data: *mut *mut ::std::os::raw::c_uchar,
    ) -> usize;
}
extern "C" {
    #[doc = "Return strlen(s), if that is less than maxlen, or maxlen if\nthere is no null byte ('\\0') among the first maxlen bytes."]
    pub fn fz_strnlen(s: *const ::std::os::raw::c_char, maxlen: usize) -> usize;
}
extern "C" {
    #[doc = "Given a pointer to a C string (or a pointer to NULL) break\nit at the first occurrence of a delimiter char (from a given\nset).\n\nstringp: Pointer to a C string pointer (or NULL). Updated on\nexit to point to the first char of the string after the\ndelimiter that was found. The string pointed to by stringp will\nbe corrupted by this call (as the found delimiter will be\noverwritten by 0).\n\ndelim: A C string of acceptable delimiter characters.\n\nReturns a pointer to a C string containing the chars of stringp\nup to the first delimiter char (or the end of the string), or\nNULL."]
    pub fn fz_strsep(
        stringp: *mut *mut ::std::os::raw::c_char,
        delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Copy at most n-1 chars of a string into a destination\nbuffer with null termination, returning the real length of the\ninitial string (excluding terminator).\n\ndst: Destination buffer, at least n bytes long.\n\nsrc: C string (non-NULL).\n\nn: Size of dst buffer in bytes.\n\nReturns the length (excluding terminator) of src."]
    pub fn fz_strlcpy(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        n: usize,
    ) -> usize;
}
extern "C" {
    #[doc = "Concatenate 2 strings, with a maximum length.\n\ndst: pointer to first string in a buffer of n bytes.\n\nsrc: pointer to string to concatenate.\n\nn: Size (in bytes) of buffer that dst is in.\n\nReturns the real length that a concatenated dst + src would have\nbeen (not including terminator)."]
    pub fn fz_strlcat(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        n: usize,
    ) -> usize;
}
extern "C" {
    #[doc = "Safe strstr function.\n\nhaystack: Where to look (may be NULL).\n\nneedled: What to look for.\n\nReturns NULL if unmatched, or pointer to start of match."]
    pub fn fz_strstr(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Safe case-insensitive strstr function. (Accepts UTF-8).\n\nhaystack: Where to look (may be NULL).\n\nneedled: What to look for.\n\nReturns NULL if unmatched, or pointer to start of match."]
    pub fn fz_strstrcase(
        haystack: *const ::std::os::raw::c_char,
        needle: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Find the start of the first occurrence of the substring needle in haystack."]
    pub fn fz_memmem(
        haystack: *const ::std::os::raw::c_void,
        haystacklen: usize,
        needle: *const ::std::os::raw::c_void,
        needlelen: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "extract the directory component from a path."]
    pub fn fz_dirname(
        dir: *mut ::std::os::raw::c_char,
        path: *const ::std::os::raw::c_char,
        dirsize: usize,
    );
}
extern "C" {
    #[doc = "Find the filename component in a path."]
    pub fn fz_basename(path: *const ::std::os::raw::c_char) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "portable strverscmp(3) function"]
    pub fn fz_strverscmp(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Like fz_decode_uri_component but in-place."]
    pub fn fz_urldecode(url: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Return a new string representing the unencoded version of the given URI.\n This decodes all escape sequences except those that would result in a reserved\n character that are part of the URI syntax (; / ? : @ & = + $ , #)."]
    pub fn fz_decode_uri(
        ctx: *mut fz_context,
        s: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Return a new string representing the unencoded version of the given URI component.\n This decodes all escape sequences!"]
    pub fn fz_decode_uri_component(
        ctx: *mut fz_context,
        s: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Return a new string representing the provided string encoded as a URI."]
    pub fn fz_encode_uri(
        ctx: *mut fz_context,
        s: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Return a new string representing the provided string encoded as an URI component.\n This also encodes the special reserved characters (; / ? : @ & = + $ , #)."]
    pub fn fz_encode_uri_component(
        ctx: *mut fz_context,
        s: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Return a new string representing the provided string encoded as an URI path name.\n This also encodes the special reserved characters except /."]
    pub fn fz_encode_uri_pathname(
        ctx: *mut fz_context,
        s: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "create output file name using a template.\n\nIf the path contains %[0-9]*d, the first such pattern will be\nreplaced with the page number. If the template does not contain\nsuch a pattern, the page number will be inserted before the\nfilename extension. If the template does not have a filename\nextension, the page number will be added to the end."]
    pub fn fz_format_output_path(
        ctx: *mut fz_context,
        path: *mut ::std::os::raw::c_char,
        size: usize,
        fmt: *const ::std::os::raw::c_char,
        page: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "rewrite path to the shortest string that names the same path.\n\nEliminates multiple and trailing slashes, interprets \".\" and\n\"..\". Overwrites the string in place."]
    pub fn fz_cleanname(name: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "rewrite path to the shortest string that names the same path.\n\nEliminates multiple and trailing slashes, interprets \".\" and\n\"..\". Allocates a new string that the caller must free."]
    pub fn fz_cleanname_strdup(
        ctx: *mut fz_context,
        name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Resolve a path to an absolute file name.\nThe resolved path buffer must be of at least PATH_MAX size."]
    pub fn fz_realpath(
        path: *const ::std::os::raw::c_char,
        resolved_path: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Case insensitive (UTF8) string comparison."]
    pub fn fz_strcasecmp(
        a: *const ::std::os::raw::c_char,
        b: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Case insensitive (UTF8) string comparison.\n\nn = maximum number of bytes to read from either a or b."]
    pub fn fz_strncasecmp(
        a: *const ::std::os::raw::c_char,
        b: *const ::std::os::raw::c_char,
        n: usize,
    ) -> ::std::os::raw::c_int;
}
pub const FZ_UTFMAX: _bindgen_ty_4 = 4;
#[doc = "FZ_UTFMAX: Maximum number of bytes in a decoded rune (maximum\nlength returned by fz_chartorune)."]
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
extern "C" {
    #[doc = "UTF8 decode a single rune from a sequence of chars.\n\nrune: Pointer to an int to assign the decoded 'rune' to.\n(0xFFFD on error).\n\nstr: Pointer to a UTF8 encoded string.\n\nReturns the number of bytes consumed."]
    pub fn fz_chartorune(
        rune: *mut ::std::os::raw::c_int,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "UTF8 decode a single rune from a sequence of chars\nof given length.\n\nrune: Pointer to an int to assign the decoded 'rune' to.\n(0xFFFD on error).\n\nstr: Pointer to a UTF8 encoded string.\n\nn: The number of bytes available at str.\n\nReturns the number of bytes consumed."]
    pub fn fz_chartorunen(
        rune: *mut ::std::os::raw::c_int,
        str_: *const ::std::os::raw::c_char,
        n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "UTF8 encode a rune to a sequence of chars.\n\nstr: Pointer to a place to put the UTF8 encoded character.\n\nrune: Pointer to a 'rune'.\n\nReturns the number of bytes the rune took to output."]
    pub fn fz_runetochar(
        str_: *mut ::std::os::raw::c_char,
        rune: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Count how many chars are required to represent a rune.\n\nrune: The rune to encode.\n\nReturns the number of bytes required to represent this run in\nUTF8."]
    pub fn fz_runelen(rune: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Compute the index of a rune in a string.\n\nstr: Pointer to beginning of a string.\n\np: Pointer to a char in str.\n\nReturns the index of the rune pointed to by p in str."]
    pub fn fz_runeidx(
        str_: *const ::std::os::raw::c_char,
        p: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Obtain a pointer to the char representing the rune\nat a given index.\n\nstr: Pointer to beginning of a string.\n\nidx: Index of a rune to return a char pointer to.\n\nReturns a pointer to the char where the desired rune starts,\nor NULL if the string ends before the index is reached."]
    pub fn fz_runeptr(
        str_: *const ::std::os::raw::c_char,
        idx: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Count how many runes the UTF-8 encoded string\nconsists of.\n\ns: The UTF-8 encoded, NUL-terminated text string.\n\nReturns the number of runes in the string."]
    pub fn fz_utflen(s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_utf8_from_wchar(
        ctx: *mut fz_context,
        s: *const wchar_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fz_wchar_from_utf8(
        ctx: *mut fz_context,
        path: *const ::std::os::raw::c_char,
    ) -> *mut wchar_t;
}
extern "C" {
    #[doc = "Locale-independent decimal to binary conversion. On overflow\nreturn (-)INFINITY and set errno to ERANGE. On underflow return\n0 and set errno to ERANGE. Special inputs (case insensitive):\n\"NAN\", \"INF\" or \"INFINITY\"."]
    pub fn fz_strtof(s: *const ::std::os::raw::c_char, es: *mut *mut ::std::os::raw::c_char)
        -> f32;
}
extern "C" {
    pub fn fz_grisu(
        f: f32,
        s: *mut ::std::os::raw::c_char,
        exp: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Check and parse string into page ranges:\n/,?(-?\\d+|N)(-(-?\\d+|N))?/"]
    pub fn fz_is_page_range(
        ctx: *mut fz_context,
        s: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_parse_page_range(
        ctx: *mut fz_context,
        s: *const ::std::os::raw::c_char,
        a: *mut ::std::os::raw::c_int,
        b: *mut ::std::os::raw::c_int,
        n: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Unicode aware tolower and toupper functions."]
    pub fn fz_tolower(c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_toupper(c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Return true if the named file exists and is readable."]
    pub fn fz_file_exists(
        ctx: *mut fz_context,
        path: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Open the named file and wrap it in a stream.\n\nfilename: Path to a file. On non-Windows machines the filename\nshould be exactly as it would be passed to fopen(2). On Windows\nmachines, the path should be UTF-8 encoded so that non-ASCII\ncharacters can be represented. Other platforms do the encoding\nas standard anyway (and in most cases, particularly for MacOS\nand Linux, the encoding they use is UTF-8 anyway)."]
    pub fn fz_open_file(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Do the same as fz_open_file, but delete the file upon close."]
    pub fn fz_open_file_autodelete(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Open the named file and wrap it in a stream.\n\nDoes the same as fz_open_file, but in the event the file\ndoes not open, it will return NULL rather than throw an\nexception."]
    pub fn fz_try_open_file(
        ctx: *mut fz_context,
        name: *const ::std::os::raw::c_char,
    ) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Return the filename (UTF-8 encoded) from which a stream was opened.\n\nReturns NULL if the filename is not available (or the stream was\nopened from a source other than a file)."]
    pub fn fz_stream_filename(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Open a block of memory as a stream.\n\ndata: Pointer to start of data block. Ownership of the data\nblock is NOT passed in.\n\nlen: Number of bytes in data block.\n\nReturns pointer to newly created stream. May throw exceptions on\nfailure to allocate."]
    pub fn fz_open_memory(
        ctx: *mut fz_context,
        data: *const ::std::os::raw::c_uchar,
        len: usize,
    ) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Open a buffer as a stream.\n\nbuf: The buffer to open. Ownership of the buffer is NOT passed\nin (this function takes its own reference).\n\nReturns pointer to newly created stream. May throw exceptions on\nfailure to allocate."]
    pub fn fz_open_buffer(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Attach a filter to a stream that will store any\ncharacters read from the stream into the supplied buffer.\n\nchain: The underlying stream to leech from.\n\nbuf: The buffer into which the read data should be appended.\nThe buffer will be resized as required.\n\nReturns pointer to newly created stream. May throw exceptions on\nfailure to allocate."]
    pub fn fz_open_leecher(
        ctx: *mut fz_context,
        chain: *mut fz_stream,
        buf: *mut fz_buffer,
    ) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Increments the reference count for a stream. Returns the same\npointer.\n\nNever throws exceptions."]
    pub fn fz_keep_stream(ctx: *mut fz_context, stm: *mut fz_stream) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Decrements the reference count for a stream.\n\nWhen the reference count for the stream hits zero, frees the\nstorage used for the fz_stream itself, and (usually)\nreleases the underlying resources that the stream is based upon\n(depends on the method used to open the stream initially)."]
    pub fn fz_drop_stream(ctx: *mut fz_context, stm: *mut fz_stream);
}
extern "C" {
    #[doc = "return the current reading position within a stream"]
    pub fn fz_tell(ctx: *mut fz_context, stm: *mut fz_stream) -> i64;
}
extern "C" {
    #[doc = "Seek within a stream.\n\nstm: The stream to seek within.\n\noffset: The offset to seek to.\n\nwhence: From where the offset is measured (see fseek).\nSEEK_SET - start of stream.\nSEEK_CUR - current position.\nSEEK_END - end of stream."]
    pub fn fz_seek(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        offset: i64,
        whence: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Read from a stream into a given data block.\n\nstm: The stream to read from.\n\ndata: The data block to read into.\n\nlen: The length of the data block (in bytes).\n\nReturns the number of bytes read. May throw exceptions."]
    pub fn fz_read(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        data: *mut ::std::os::raw::c_uchar,
        len: usize,
    ) -> usize;
}
extern "C" {
    #[doc = "Read from a stream discarding data.\n\nstm: The stream to read from.\n\nlen: The number of bytes to read.\n\nReturns the number of bytes read. May throw exceptions."]
    pub fn fz_skip(ctx: *mut fz_context, stm: *mut fz_stream, len: usize) -> usize;
}
extern "C" {
    #[doc = "Read all of a stream into a buffer.\n\nstm: The stream to read from\n\ninitial: Suggested initial size for the buffer.\n\nReturns a buffer created from reading from the stream. May throw\nexceptions on failure to allocate."]
    pub fn fz_read_all(ctx: *mut fz_context, stm: *mut fz_stream, initial: usize)
        -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Read all the contents of a file into a buffer."]
    pub fn fz_read_file(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Read all the contents of a file into a buffer.\n\nReturns NULL if the file does not exist, otherwise\nbehaves exactly as fz_read_file."]
    pub fn fz_try_read_file(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Read all the contents of a file into a string.\nFile should be UTF-8 encoded plain text."]
    pub fn fz_read_text_file(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "fz_read_[u]int(16|24|32|64)(_le)?\n\nRead a 16/32/64 bit signed/unsigned integer from stream,\nin big or little-endian byte orders.\n\nThrows an exception if EOF is encountered."]
    pub fn fz_read_uint16(ctx: *mut fz_context, stm: *mut fz_stream) -> u16;
}
extern "C" {
    pub fn fz_read_uint24(ctx: *mut fz_context, stm: *mut fz_stream) -> u32;
}
extern "C" {
    pub fn fz_read_uint32(ctx: *mut fz_context, stm: *mut fz_stream) -> u32;
}
extern "C" {
    pub fn fz_read_uint64(ctx: *mut fz_context, stm: *mut fz_stream) -> u64;
}
extern "C" {
    pub fn fz_read_uint16_le(ctx: *mut fz_context, stm: *mut fz_stream) -> u16;
}
extern "C" {
    pub fn fz_read_uint24_le(ctx: *mut fz_context, stm: *mut fz_stream) -> u32;
}
extern "C" {
    pub fn fz_read_uint32_le(ctx: *mut fz_context, stm: *mut fz_stream) -> u32;
}
extern "C" {
    pub fn fz_read_uint64_le(ctx: *mut fz_context, stm: *mut fz_stream) -> u64;
}
extern "C" {
    pub fn fz_read_int16(ctx: *mut fz_context, stm: *mut fz_stream) -> i16;
}
extern "C" {
    pub fn fz_read_int32(ctx: *mut fz_context, stm: *mut fz_stream) -> i32;
}
extern "C" {
    pub fn fz_read_int64(ctx: *mut fz_context, stm: *mut fz_stream) -> i64;
}
extern "C" {
    pub fn fz_read_int16_le(ctx: *mut fz_context, stm: *mut fz_stream) -> i16;
}
extern "C" {
    pub fn fz_read_int32_le(ctx: *mut fz_context, stm: *mut fz_stream) -> i32;
}
extern "C" {
    pub fn fz_read_int64_le(ctx: *mut fz_context, stm: *mut fz_stream) -> i64;
}
extern "C" {
    pub fn fz_read_float_le(ctx: *mut fz_context, stm: *mut fz_stream) -> f32;
}
extern "C" {
    pub fn fz_read_float(ctx: *mut fz_context, stm: *mut fz_stream) -> f32;
}
extern "C" {
    #[doc = "Read a null terminated string from the stream into\na buffer of a given length. The buffer will be null terminated.\nThrows on failure (including the failure to fit the entire\nstring including the terminator into the buffer)."]
    pub fn fz_read_string(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        buffer: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Read a utf-8 rune from a stream.\n\nIn the event of encountering badly formatted utf-8 codes\n(such as a leading code with an unexpected number of following\ncodes) no error/exception is given, but undefined values may be\nreturned."]
    pub fn fz_read_rune(ctx: *mut fz_context, in_: *mut fz_stream) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Read a utf-16 rune from a stream. (little endian and\nbig endian respectively).\n\nIn the event of encountering badly formatted utf-16 codes\n(mismatched surrogates) no error/exception is given, but\nundefined values may be returned."]
    pub fn fz_read_utf16_le(ctx: *mut fz_context, stm: *mut fz_stream) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_read_utf16_be(ctx: *mut fz_context, stm: *mut fz_stream) -> ::std::os::raw::c_int;
}
#[doc = "A function type for use when implementing\nfz_streams. The supplied function of this type is called\nwhenever data is required, and the current buffer is empty.\n\nstm: The stream to operate on.\n\nmax: a hint as to the maximum number of bytes that the caller\nneeds to be ready immediately. Can safely be ignored.\n\nReturns -1 if there is no more data in the stream. Otherwise,\nthe function should find its internal state using stm->state,\nrefill its buffer, update stm->rp and stm->wp to point to the\nstart and end of the new data respectively, and then\n\"return *stm->rp++\"."]
pub type fz_stream_next_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        max: usize,
    ) -> ::std::os::raw::c_int,
>;
#[doc = "A function type for use when implementing\nfz_streams. The supplied function of this type is called\nwhen the stream is dropped, to release the stream specific\nstate information.\n\nstate: The stream state to release."]
pub type fz_stream_drop_fn = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::std::os::raw::c_void),
>;
#[doc = "A function type for use when implementing\nfz_streams. The supplied function of this type is called when\nfz_seek is requested, and the arguments are as defined for\nfz_seek.\n\nThe stream can find it's private state in stm->state."]
pub type fz_stream_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        offset: i64,
        whence: ::std::os::raw::c_int,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_stream {
    pub refs: ::std::os::raw::c_int,
    pub error: ::std::os::raw::c_int,
    pub eof: ::std::os::raw::c_int,
    pub progressive: ::std::os::raw::c_int,
    pub pos: i64,
    pub avail: ::std::os::raw::c_int,
    pub bits: ::std::os::raw::c_int,
    pub rp: *mut ::std::os::raw::c_uchar,
    pub wp: *mut ::std::os::raw::c_uchar,
    pub state: *mut ::std::os::raw::c_void,
    pub next: fz_stream_next_fn,
    pub drop: fz_stream_drop_fn,
    pub seek: fz_stream_seek_fn,
}
#[test]
fn bindgen_test_layout_fz_stream() {
    const UNINIT: ::std::mem::MaybeUninit<fz_stream> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_stream>(),
        80usize,
        concat!("Size of: ", stringify!(fz_stream))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_stream>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_stream))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eof) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(eof)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).progressive) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(progressive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).avail) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(avail)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bits) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wp) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(wp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drop) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(drop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_stream),
            "::",
            stringify!(seek)
        )
    );
}
extern "C" {
    #[doc = "Create a new stream object with the given\ninternal state and function pointers.\n\nstate: Internal state (opaque to everything but implementation).\n\nnext: Should provide the next set of bytes (up to max) of stream\ndata. Return the number of bytes read, or EOF when there is no\nmore data.\n\ndrop: Should clean up and free the internal state. May not\nthrow exceptions."]
    pub fn fz_new_stream(
        ctx: *mut fz_context,
        state: *mut ::std::os::raw::c_void,
        next: fz_stream_next_fn,
        drop: fz_stream_drop_fn,
    ) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Attempt to read a stream into a buffer. If truncated\nis NULL behaves as fz_read_all, sets a truncated flag in case of\nerror.\n\nstm: The stream to read from.\n\ninitial: Suggested initial size for the buffer.\n\ntruncated: Flag to store success/failure indication in.\n\nworst_case: 0 for unknown, otherwise an upper bound for the\nsize of the stream.\n\nReturns a buffer created from reading from the stream."]
    pub fn fz_read_best(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        initial: usize,
        truncated: *mut ::std::os::raw::c_int,
        worst_case: usize,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Read a line from stream into the buffer until either a\nterminating newline or EOF, which it replaces with a null byte\n('\\0').\n\nReturns buf on success, and NULL when end of file occurs while\nno characters have been read."]
    pub fn fz_read_line(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        buf: *mut ::std::os::raw::c_char,
        max: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Skip over a given string in a stream. Return 0 if successfully\nskipped, non-zero otherwise. As many characters will be skipped\nover as matched in the string."]
    pub fn fz_skip_string(
        ctx: *mut fz_context,
        stm: *mut fz_stream,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Skip over whitespace (bytes <= 32) in a stream."]
    pub fn fz_skip_space(ctx: *mut fz_context, stm: *mut fz_stream);
}
extern "C" {
    #[doc = "Create a stream from a FILE * that will not be closed\nwhen the stream is dropped."]
    pub fn fz_open_file_ptr_no_close(ctx: *mut fz_context, file: *mut FILE) -> *mut fz_stream;
}
#[doc = "A function type for use when implementing\nfz_outputs. The supplied function of this type is called\nwhenever data is written to the output.\n\nstate: The state for the output stream.\n\ndata: a pointer to a buffer of data to write.\n\nn: The number of bytes of data to write."]
pub type fz_output_write_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        state: *mut ::std::os::raw::c_void,
        data: *const ::std::os::raw::c_void,
        n: usize,
    ),
>;
#[doc = "A function type for use when implementing\nfz_outputs. The supplied function of this type is called when\nfz_seek_output is requested.\n\nstate: The output stream state to seek within.\n\noffset, whence: as defined for fz_seek()."]
pub type fz_output_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        state: *mut ::std::os::raw::c_void,
        offset: i64,
        whence: ::std::os::raw::c_int,
    ),
>;
#[doc = "A function type for use when implementing\nfz_outputs. The supplied function of this type is called when\nfz_tell_output is requested.\n\nstate: The output stream state to report on.\n\nReturns the offset within the output stream."]
pub type fz_output_tell_fn = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::std::os::raw::c_void) -> i64,
>;
#[doc = "A function type for use when implementing\nfz_outputs. The supplied function of this type is called\nwhen the output stream is closed, to flush any pending writes."]
pub type fz_output_close_fn = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::std::os::raw::c_void),
>;
#[doc = "A function type for use when implementing\nfz_outputs. The supplied function of this type is called\nwhen the output stream is reset, and resets the state\nto that when it was first initialised."]
pub type fz_output_reset_fn = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::std::os::raw::c_void),
>;
#[doc = "A function type for use when implementing\nfz_outputs. The supplied function of this type is called\nwhen the output stream is dropped, to release the stream\nspecific state information."]
pub type fz_output_drop_fn = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::std::os::raw::c_void),
>;
#[doc = "A function type for use when implementing\nfz_outputs. The supplied function of this type is called\nwhen the fz_stream_from_output is called."]
pub type fz_stream_from_output_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        state: *mut ::std::os::raw::c_void,
    ) -> *mut fz_stream,
>;
#[doc = "A function type for use when implementing\nfz_outputs. The supplied function of this type is called\nwhen fz_truncate_output is called to truncate the file\nat that point."]
pub type fz_truncate_fn = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, state: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_output {
    pub state: *mut ::std::os::raw::c_void,
    pub write: fz_output_write_fn,
    pub seek: fz_output_seek_fn,
    pub tell: fz_output_tell_fn,
    pub close: fz_output_close_fn,
    pub drop: fz_output_drop_fn,
    pub reset: fz_output_reset_fn,
    pub as_stream: fz_stream_from_output_fn,
    pub truncate: fz_truncate_fn,
    pub closed: ::std::os::raw::c_int,
    pub bp: *mut ::std::os::raw::c_char,
    pub wp: *mut ::std::os::raw::c_char,
    pub ep: *mut ::std::os::raw::c_char,
    pub buffered: ::std::os::raw::c_int,
    pub bits: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_fz_output() {
    const UNINIT: ::std::mem::MaybeUninit<fz_output> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_output>(),
        112usize,
        concat!("Size of: ", stringify!(fz_output))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_output>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_output))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tell) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(tell)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drop) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(drop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reset) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(reset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).as_stream) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(as_stream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).truncate) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(truncate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).closed) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(closed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bp) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(bp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wp) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(wp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ep) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(ep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffered) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(buffered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bits) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_output),
            "::",
            stringify!(bits)
        )
    );
}
extern "C" {
    #[doc = "Create a new output object with the given\ninternal state and function pointers.\n\nstate: Internal state (opaque to everything but implementation).\n\nwrite: Function to output a given buffer.\n\nclose: Cleanup function to destroy state when output closed.\nMay permissibly be null."]
    pub fn fz_new_output(
        ctx: *mut fz_context,
        bufsiz: ::std::os::raw::c_int,
        state: *mut ::std::os::raw::c_void,
        write: fz_output_write_fn,
        close: fz_output_close_fn,
        drop: fz_output_drop_fn,
    ) -> *mut fz_output;
}
extern "C" {
    #[doc = "Open an output stream that writes to a\ngiven path. This stream will always be a binary stream.\n\nOn Windows, if this stream is stdout or stderr, these will\nbe set to binary.\n\nfilename: The filename to write to (specified in UTF-8).\n\nappend: non-zero if we should append to the file, rather than\noverwriting it."]
    pub fn fz_new_output_with_path(
        arg1: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
        append: ::std::os::raw::c_int,
    ) -> *mut fz_output;
}
extern "C" {
    #[doc = "Open an output stream that writes to a\ngiven FILE *.\n\nfile: The file pointers to write to. NULL is interpreted as effectively\nmeaning /dev/null or similar."]
    pub fn fz_new_output_with_file_ptr(ctx: *mut fz_context, file: *mut FILE) -> *mut fz_output;
}
extern "C" {
    #[doc = "Open an output stream that appends\nto a buffer.\n\nbuf: The buffer to append to."]
    pub fn fz_new_output_with_buffer(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_output;
}
extern "C" {
    #[doc = "Retrieve an fz_output that directs to stdout.\n\nOptionally may be fz_dropped when finished with."]
    pub fn fz_stdout(ctx: *mut fz_context) -> *mut fz_output;
}
extern "C" {
    #[doc = "Retrieve an fz_output that directs to stdout.\n\nOptionally may be fz_dropped when finished with."]
    pub fn fz_stderr(ctx: *mut fz_context) -> *mut fz_output;
}
extern "C" {
    #[doc = "Set the output stream to be used for fz_stddbg. Set to NULL to\nreset to default (stderr)."]
    pub fn fz_set_stddbg(ctx: *mut fz_context, out: *mut fz_output);
}
extern "C" {
    #[doc = "Retrieve an fz_output for the default debugging stream. On\nWindows this will be OutputDebugString for non-console apps.\nOtherwise, it is always fz_stderr.\n\nOptionally may be fz_dropped when finished with."]
    pub fn fz_stddbg(ctx: *mut fz_context) -> *mut fz_output;
}
extern "C" {
    #[doc = "Format and write data to an output stream.\nSee fz_format_string for formatting details."]
    pub fn fz_write_printf(
        ctx: *mut fz_context,
        out: *mut fz_output,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    #[doc = "va_list version of fz_write_printf."]
    pub fn fz_write_vprintf(
        ctx: *mut fz_context,
        out: *mut fz_output,
        fmt: *const ::std::os::raw::c_char,
        ap: va_list,
    );
}
extern "C" {
    #[doc = "Seek to the specified file position.\nSee fseek for arguments.\n\nThrow an error on unseekable outputs."]
    pub fn fz_seek_output(
        ctx: *mut fz_context,
        out: *mut fz_output,
        off: i64,
        whence: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Return the current file position.\n\nThrow an error on untellable outputs."]
    pub fn fz_tell_output(ctx: *mut fz_context, out: *mut fz_output) -> i64;
}
extern "C" {
    #[doc = "Flush unwritten data."]
    pub fn fz_flush_output(ctx: *mut fz_context, out: *mut fz_output);
}
extern "C" {
    #[doc = "Flush pending output and close an output stream."]
    pub fn fz_close_output(arg1: *mut fz_context, arg2: *mut fz_output);
}
extern "C" {
    #[doc = "Reset a closed output stream. Returns state to\n(broadly) that which it was in when opened. Not\nall outputs can be reset, so this may throw an\nexception."]
    pub fn fz_reset_output(arg1: *mut fz_context, arg2: *mut fz_output);
}
extern "C" {
    #[doc = "Free an output stream. Don't forget to close it first!"]
    pub fn fz_drop_output(arg1: *mut fz_context, arg2: *mut fz_output);
}
extern "C" {
    #[doc = "Query whether a given fz_output supports fz_stream_from_output."]
    pub fn fz_output_supports_stream(
        ctx: *mut fz_context,
        out: *mut fz_output,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Obtain the fz_output in the form of a fz_stream.\n\nThis allows data to be read back from some forms of fz_output\nobject. When finished reading, the fz_stream should be released\nby calling fz_drop_stream. Until the fz_stream is dropped, no\nfurther operations should be performed on the fz_output object."]
    pub fn fz_stream_from_output(arg1: *mut fz_context, arg2: *mut fz_output) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Truncate the output at the current position.\n\nThis allows output streams which have seeked back from the end\nof their storage to be truncated at the current point."]
    pub fn fz_truncate_output(arg1: *mut fz_context, arg2: *mut fz_output);
}
extern "C" {
    #[doc = "Write data to output.\n\ndata: Pointer to data to write.\nsize: Size of data to write in bytes."]
    pub fn fz_write_data(
        ctx: *mut fz_context,
        out: *mut fz_output,
        data: *const ::std::os::raw::c_void,
        size: usize,
    );
}
extern "C" {
    pub fn fz_write_buffer(ctx: *mut fz_context, out: *mut fz_output, data: *mut fz_buffer);
}
extern "C" {
    #[doc = "Write a string. Does not write zero terminator."]
    pub fn fz_write_string(
        ctx: *mut fz_context,
        out: *mut fz_output,
        s: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Write different sized data to an output stream."]
    pub fn fz_write_int32_be(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_write_int32_le(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_write_uint32_be(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn fz_write_uint32_le(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn fz_write_int16_be(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_write_int16_le(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fz_write_uint16_be(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn fz_write_uint16_le(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn fz_write_char(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_char);
}
extern "C" {
    pub fn fz_write_byte(ctx: *mut fz_context, out: *mut fz_output, x: ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn fz_write_float_be(ctx: *mut fz_context, out: *mut fz_output, f: f32);
}
extern "C" {
    pub fn fz_write_float_le(ctx: *mut fz_context, out: *mut fz_output, f: f32);
}
extern "C" {
    #[doc = "Write a UTF-8 encoded unicode character."]
    pub fn fz_write_rune(ctx: *mut fz_context, out: *mut fz_output, rune: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = "Write a base64 encoded data block, optionally with periodic\nnewlines."]
    pub fn fz_write_base64(
        ctx: *mut fz_context,
        out: *mut fz_output,
        data: *const ::std::os::raw::c_uchar,
        size: usize,
        newline: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Write a base64 encoded fz_buffer, optionally with periodic\nnewlines."]
    pub fn fz_write_base64_buffer(
        ctx: *mut fz_context,
        out: *mut fz_output,
        data: *mut fz_buffer,
        newline: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Write num_bits of data to the end of the output stream, assumed to be packed\nmost significant bits first."]
    pub fn fz_write_bits(
        ctx: *mut fz_context,
        out: *mut fz_output,
        data: ::std::os::raw::c_uint,
        num_bits: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Sync to byte boundary after writing bits."]
    pub fn fz_write_bits_sync(ctx: *mut fz_context, out: *mut fz_output);
}
extern "C" {
    #[doc = "Copy the stream contents to the output."]
    pub fn fz_write_stream(ctx: *mut fz_context, out: *mut fz_output, in_: *mut fz_stream);
}
extern "C" {
    #[doc = "Our customised 'printf'-like string formatter.\nTakes %c, %d, %s, %u, %x, %X as usual.\nThe only modifiers supported are:\n1) zero-padding ints (e.g. %02d, %03u, %04x, etc).\n2) ' to indicate that ' should be inserted into\nintegers as thousands separators.\n3) , to indicate that , should be inserted into\nintegers as thousands separators.\n4) _ to indicate that , should be inserted into\nintegers as thousands separators.\nPosix chooses the thousand separator in a locale\nspecific way - we do not. We always apply it every\n3 characters for the positive part of integers, so\nother styles, such as Indian (123,456,78) are not\nsupported.\n\n%g output in \"as short as possible hopefully lossless\nnon-exponent\" form, see fz_ftoa for specifics.\n%f and %e output as usual.\n%C outputs a utf8 encoded int.\n%M outputs a fz_matrix*.\n%R outputs a fz_rect*.\n%P outputs a fz_point*.\n%n outputs a PDF name (with appropriate escaping).\n%q and %( output escaped strings in C/PDF syntax.\n%l{d,u,x,X} indicates that the values are int64_t.\n%z{d,u,x,X} indicates that the value is a size_t.\n%< outputs a quoted (utf8) string (for XML).\n%> outputs a hex string for a zero terminated string of bytes.\n\nuser: An opaque pointer that is passed to the emit function.\n\nemit: A function pointer called to emit output bytes as the\nstring is being formatted."]
    pub fn fz_format_string(
        ctx: *mut fz_context,
        user: *mut ::std::os::raw::c_void,
        emit: ::std::option::Option<
            unsafe extern "C" fn(
                ctx: *mut fz_context,
                user: *mut ::std::os::raw::c_void,
                c: ::std::os::raw::c_int,
            ),
        >,
        fmt: *const ::std::os::raw::c_char,
        args: va_list,
    );
}
extern "C" {
    #[doc = "A vsnprintf work-alike, using our custom formatter."]
    pub fn fz_vsnprintf(
        buffer: *mut ::std::os::raw::c_char,
        space: usize,
        fmt: *const ::std::os::raw::c_char,
        args: va_list,
    ) -> usize;
}
extern "C" {
    #[doc = "The non va_list equivalent of fz_vsnprintf."]
    pub fn fz_snprintf(
        buffer: *mut ::std::os::raw::c_char,
        space: usize,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> usize;
}
extern "C" {
    #[doc = "Allocated sprintf.\n\nReturns a null terminated allocated block containing the\nformatted version of the format string/args."]
    pub fn fz_asprintf(
        ctx: *mut fz_context,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Save the contents of a buffer to a file."]
    pub fn fz_save_buffer(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        filename: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Compression and other filtering outputs.\n\nThese outputs write encoded data to another output. Create a\nfilter output with the destination, write to the filter, then\nclose and drop it when you're done. These can also be chained\ntogether, for example to write ASCII Hex encoded, Deflate\ncompressed, and RC4 encrypted data to a buffer output.\n\nOutput streams don't use reference counting, so make sure to\nclose all of the filters in the reverse order of creation so\nthat data is flushed properly.\n\nAccordingly, ownership of 'chain' is never passed into the\nfollowing functions, but remains with the caller, whose\nresponsibility it is to ensure they exist at least until\nthe returned fz_output is dropped."]
    pub fn fz_new_asciihex_output(ctx: *mut fz_context, chain: *mut fz_output) -> *mut fz_output;
}
extern "C" {
    pub fn fz_new_ascii85_output(ctx: *mut fz_context, chain: *mut fz_output) -> *mut fz_output;
}
extern "C" {
    pub fn fz_new_rle_output(ctx: *mut fz_context, chain: *mut fz_output) -> *mut fz_output;
}
extern "C" {
    pub fn fz_new_arc4_output(
        ctx: *mut fz_context,
        chain: *mut fz_output,
        key: *mut ::std::os::raw::c_uchar,
        keylen: usize,
    ) -> *mut fz_output;
}
extern "C" {
    pub fn fz_new_deflate_output(
        ctx: *mut fz_context,
        chain: *mut fz_output,
        effort: ::std::os::raw::c_int,
        raw: ::std::os::raw::c_int,
    ) -> *mut fz_output;
}
extern "C" {
    pub fn fz_is_valid_xml_char(c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_range_limit_xml_char(c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_is_valid_xml_string(s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Output a line to the log."]
    pub fn fz_log(ctx: *mut fz_context, fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[doc = "Output a line to the log for a given module."]
    pub fn fz_log_module(
        ctx: *mut fz_context,
        module: *const ::std::os::raw::c_char,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    #[doc = "Internal function to actually do the opening of the logfile.\n\nCaller should close/drop the output when finished with it."]
    pub fn fz_new_log_for_module(
        ctx: *mut fz_context,
        module: *const ::std::os::raw::c_char,
    ) -> *mut fz_output;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_pool {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = "Create a new pool to allocate from."]
    pub fn fz_new_pool(ctx: *mut fz_context) -> *mut fz_pool;
}
extern "C" {
    #[doc = "Allocate a block of size bytes from the pool.\nBlock will be inited to 0's."]
    pub fn fz_pool_alloc(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "strdup equivalent allocating from the pool."]
    pub fn fz_pool_strdup(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        s: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "strndup equivalent allocating from the pool."]
    pub fn fz_pool_strndup(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        s: *const ::std::os::raw::c_char,
        n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "The current size of the pool.\n\nThe number of bytes of storage currently allocated to the pool.\nThis is the total of the storage used for the blocks making\nup the pool, rather then total of the allocated blocks so far,\nso it will increase in 'lumps'.\nfrom the pool, then the pool size may still be X"]
    pub fn fz_pool_size(ctx: *mut fz_context, pool: *mut fz_pool) -> usize;
}
extern "C" {
    #[doc = "Drop a pool, freeing and invalidating all storage returned from\nthe pool."]
    pub fn fz_drop_pool(ctx: *mut fz_context, pool: *mut fz_pool);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_pool_array {
    _unused: [u8; 0],
}
extern "C" {
    pub fn fz_new_pool_array_imp(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        size: usize,
        initial: usize,
    ) -> *mut fz_pool_array;
}
extern "C" {
    #[doc = "Append an element to the end of the array.\n\nReturns a pointer to the new element (initially all 0's), and\n(optionally) the index of that element."]
    pub fn fz_pool_array_append(
        ctx: *mut fz_context,
        arr: *mut fz_pool_array,
        idx: *mut usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Lookup an element in the array."]
    pub fn fz_pool_array_lookup(
        ctx: *mut fz_context,
        arr: *mut fz_pool_array,
        idx: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Get the length of the array."]
    pub fn fz_pool_array_len(ctx: *mut fz_context, arr: *mut fz_pool_array) -> usize;
}
extern "C" {
    #[doc = "Create an options object, with the initial contents parsed from the string.\nSee fz_parse_options for details on the string parsing.\nIf the string is NULL, the options object will be initialized but empty."]
    pub fn fz_new_options(
        ctx: *mut fz_context,
        option_string: *const ::std::os::raw::c_char,
    ) -> *mut fz_options;
}
extern "C" {
    #[doc = "Parse more options from an options string, and add them to\nan existing fz_options object.\n\nThe parser supports three distinct syntaxes (identified by the leading character).\n\n- Classic comma separated list of values\nrotate=90,bbox=\"0,0,100,100\",title=\"Hello, world!\"\n\n- URL query string\n?rotate=90&bbox=0,0,100,100&title=Hello, world!\n\n- A single JSON object -- no nested objects (except arrays of numbers)\n{\"rotate\":90,\"bbox\":[0,0,100,100],\"title\":\"Hello, world!\"}"]
    pub fn fz_parse_options(
        ctx: *mut fz_context,
        options: *mut fz_options,
        option_string: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Take a new reference to the options struct."]
    pub fn fz_keep_options(ctx: *mut fz_context, opts: *mut fz_options) -> *mut fz_options;
}
extern "C" {
    #[doc = "Drop an fz_options object."]
    pub fn fz_drop_options(ctx: *mut fz_context, opts: *mut fz_options);
}
extern "C" {
    #[doc = "Check to see if a key is present in the options object.\n\nIf it is not, then return 0.\n\nIf val is non-NULL, *val will be updated to point to the value.\n\nThe option will be recorded as having been accessed."]
    pub fn fz_lookup_option(
        ctx: *mut fz_context,
        options: *mut fz_options,
        key: *const ::std::os::raw::c_char,
        val: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Check to see if a key is a boolean.\n\nIf it is absent, return 0.\n\nIf it is true (empty, 1, yes, true, or enabled), returns 1,\nclears any invalid flag, and counts as accessed.\n\nIf it is false (0, no, false, or disabled), returns 0,\nclears any invalid flag, and counts as accessed.\n\nIf it is absent, or any other value, it is marked as invalid, returns 0."]
    pub fn fz_lookup_option_yes(
        ctx: *mut fz_context,
        options: *mut fz_options,
        key: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Check to see if a key is present, and is true or false.\n\nIf it is absent, return 0.\n\nIf it is true (empty, 1, yes, true, or enabled), *x is assigned 1,\nthe invalid flag is cleared, marked as accessed, returns 1.\n\nIf it is false (0, no, false, or disabled), *x is assigned 0,\nthe invalid flag is clear, marked as accessed, returns 0.\n\nIf it is any other value, it is marked as invalid, returns -1."]
    pub fn fz_lookup_option_boolean(
        ctx: *mut fz_context,
        options: *mut fz_options,
        key: *const ::std::os::raw::c_char,
        x: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Check to see if an option is present and is of the given type.\n\nIf an option is absent, this returns 0.\n\nIf an option is present, but not of the required type, it will be\nflagged internally as being invalid, and we will return -1.\n\nIf an option is present, and of the required type, any previously\nset invalid flag will be cleared.\n\nThis means we can (for example) lookup an option as an enum, and then\nsafely look for it being an integer if that fails."]
    pub fn fz_lookup_option_float(
        ctx: *mut fz_context,
        options: *mut fz_options,
        key: *const ::std::os::raw::c_char,
        x: *mut f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_lookup_option_integer(
        ctx: *mut fz_context,
        options: *mut fz_options,
        key: *const ::std::os::raw::c_char,
        x: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_lookup_option_unsigned(
        ctx: *mut fz_context,
        options: *mut fz_options,
        key: *const ::std::os::raw::c_char,
        x: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_option_enums {
    pub key: *const ::std::os::raw::c_char,
    pub val: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_fz_option_enums() {
    const UNINIT: ::std::mem::MaybeUninit<fz_option_enums> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_option_enums>(),
        16usize,
        concat!("Size of: ", stringify!(fz_option_enums))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_option_enums>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_option_enums))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_option_enums),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_option_enums),
            "::",
            stringify!(val)
        )
    );
}
extern "C" {
    pub fn fz_lookup_option_enum(
        ctx: *mut fz_context,
        options: *mut fz_options,
        key: *const ::std::os::raw::c_char,
        x: *mut ::std::os::raw::c_int,
        enum_list: *const fz_option_enums,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "This should be called by any consumer of options after it has looked up\nthe options it understands. This will throw if any options were found to\nbe flagged as being invalid."]
    pub fn fz_validate_options(
        ctx: *mut fz_context,
        options: *mut fz_options,
        prefix: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Warn for any options being unused. Throw if any options are invalid.\n\nEither this, or fz_throw_on_unused_options should always be called\n(in non-error cases at least) before dropping options.\n\nReturns 0 if OK, non-zero otherwise."]
    pub fn fz_warn_on_unused_options(
        ctx: *mut fz_context,
        options: *mut fz_options,
        prefix: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Throw for any options being unused or invalid.\n\nEither this, or fz_warn_on_unused_options should always be called\n(in non-error cases at least) before dropping options.\n\nReturns 0 if OK, non-zero otherwise."]
    pub fn fz_throw_on_unused_options(
        ctx: *mut fz_context,
        options: *mut fz_options,
        prefix: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Count the number of options in an options structure."]
    pub fn fz_count_options(
        ctx: *mut fz_context,
        options: *mut fz_options,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Get an option by index."]
    pub fn fz_get_option_by_index(
        ctx: *mut fz_context,
        options: *mut fz_options,
        i: ::std::os::raw::c_int,
        val: *mut *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Mark a given option index as being accessed."]
    pub fn fz_access_option_by_index(
        ctx: *mut fz_context,
        options: *mut fz_options,
        i: ::std::os::raw::c_int,
    );
}
#[doc = "Implementation details: subject to change. Only public for\nSWIG built wrappers."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_option {
    pub flags: ::std::os::raw::c_int,
    pub key: *mut ::std::os::raw::c_char,
    pub val: *mut ::std::os::raw::c_char,
    pub next: *mut fz_option,
}
#[test]
fn bindgen_test_layout_fz_option() {
    const UNINIT: ::std::mem::MaybeUninit<fz_option> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_option>(),
        32usize,
        concat!("Size of: ", stringify!(fz_option))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_option>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_option))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_option),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_option),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_option),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_option),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_options {
    pub refs: ::std::os::raw::c_int,
    pub pool: *mut fz_pool,
    pub head: *mut fz_option,
}
#[test]
fn bindgen_test_layout_fz_options() {
    const UNINIT: ::std::mem::MaybeUninit<fz_options> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_options>(),
        24usize,
        concat!("Size of: ", stringify!(fz_options))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_options>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_options))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_options),
            "::",
            stringify!(refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_options),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_options),
            "::",
            stringify!(head)
        )
    );
}
#[doc = "Structure definition is public to enable stack\nbased allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_md5 {
    pub lo: u32,
    pub hi: u32,
    pub a: u32,
    pub b: u32,
    pub c: u32,
    pub d: u32,
    pub buffer: [::std::os::raw::c_uchar; 64usize],
}
#[test]
fn bindgen_test_layout_fz_md5() {
    const UNINIT: ::std::mem::MaybeUninit<fz_md5> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_md5>(),
        88usize,
        concat!("Size of: ", stringify!(fz_md5))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_md5>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_md5))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_md5),
            "::",
            stringify!(lo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hi) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_md5),
            "::",
            stringify!(hi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(fz_md5), "::", stringify!(a))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(fz_md5), "::", stringify!(b))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).c) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(fz_md5), "::", stringify!(c))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(fz_md5), "::", stringify!(d))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_md5),
            "::",
            stringify!(buffer)
        )
    );
}
extern "C" {
    #[doc = "MD5 initialization. Begins an MD5 operation, writing a new\ncontext.\n\nNever throws an exception."]
    pub fn fz_md5_init(state: *mut fz_md5);
}
extern "C" {
    #[doc = "MD5 block update operation. Continues an MD5 message-digest\noperation, processing another message block, and updating the\ncontext.\n\nNever throws an exception."]
    pub fn fz_md5_update(state: *mut fz_md5, input: *const ::std::os::raw::c_uchar, inlen: usize);
}
extern "C" {
    #[doc = "MD5 block update operation. Continues an MD5 message-digest\noperation, processing an int64, and updating the context.\n\nNever throws an exception."]
    pub fn fz_md5_update_int64(state: *mut fz_md5, i: i64);
}
extern "C" {
    #[doc = "MD5 finalization. Ends an MD5 message-digest operation, writing\nthe message digest and zeroizing the context.\n\nNever throws an exception."]
    pub fn fz_md5_final(state: *mut fz_md5, digest: *mut ::std::os::raw::c_uchar);
}
#[doc = "Structure definition is public to enable stack\nbased allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_sha256 {
    pub state: [::std::os::raw::c_uint; 8usize],
    pub count: [::std::os::raw::c_uint; 2usize],
    pub buffer: fz_sha256__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_sha256__bindgen_ty_1 {
    pub u8_: [::std::os::raw::c_uchar; 64usize],
    pub u32_: [::std::os::raw::c_uint; 16usize],
}
#[test]
fn bindgen_test_layout_fz_sha256__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<fz_sha256__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_sha256__bindgen_ty_1>(),
        64usize,
        concat!("Size of: ", stringify!(fz_sha256__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_sha256__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_sha256__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha256__bindgen_ty_1),
            "::",
            stringify!(u8_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha256__bindgen_ty_1),
            "::",
            stringify!(u32_)
        )
    );
}
#[test]
fn bindgen_test_layout_fz_sha256() {
    const UNINIT: ::std::mem::MaybeUninit<fz_sha256> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_sha256>(),
        104usize,
        concat!("Size of: ", stringify!(fz_sha256))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_sha256>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_sha256))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha256),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha256),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha256),
            "::",
            stringify!(buffer)
        )
    );
}
extern "C" {
    #[doc = "SHA256 initialization. Begins an SHA256 operation, initialising\nthe supplied context.\n\nNever throws an exception."]
    pub fn fz_sha256_init(state: *mut fz_sha256);
}
extern "C" {
    #[doc = "SHA256 block update operation. Continues an SHA256 message-\ndigest operation, processing another message block, and updating\nthe context.\n\nNever throws an exception."]
    pub fn fz_sha256_update(
        state: *mut fz_sha256,
        input: *const ::std::os::raw::c_uchar,
        inlen: usize,
    );
}
extern "C" {
    #[doc = "MD5 finalization. Ends an MD5 message-digest operation, writing\nthe message digest and zeroizing the context.\n\nNever throws an exception."]
    pub fn fz_sha256_final(state: *mut fz_sha256, digest: *mut ::std::os::raw::c_uchar);
}
#[doc = "Structure definition is public to enable stack\nbased allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_sha512 {
    pub state: [u64; 8usize],
    pub count: [::std::os::raw::c_uint; 2usize],
    pub buffer: fz_sha512__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_sha512__bindgen_ty_1 {
    pub u8_: [::std::os::raw::c_uchar; 128usize],
    pub u64_: [u64; 16usize],
}
#[test]
fn bindgen_test_layout_fz_sha512__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<fz_sha512__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_sha512__bindgen_ty_1>(),
        128usize,
        concat!("Size of: ", stringify!(fz_sha512__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_sha512__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_sha512__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u8_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha512__bindgen_ty_1),
            "::",
            stringify!(u8_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u64_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha512__bindgen_ty_1),
            "::",
            stringify!(u64_)
        )
    );
}
#[test]
fn bindgen_test_layout_fz_sha512() {
    const UNINIT: ::std::mem::MaybeUninit<fz_sha512> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_sha512>(),
        200usize,
        concat!("Size of: ", stringify!(fz_sha512))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_sha512>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_sha512))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha512),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha512),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_sha512),
            "::",
            stringify!(buffer)
        )
    );
}
extern "C" {
    #[doc = "SHA512 initialization. Begins an SHA512 operation, initialising\nthe supplied context.\n\nNever throws an exception."]
    pub fn fz_sha512_init(state: *mut fz_sha512);
}
extern "C" {
    #[doc = "SHA512 block update operation. Continues an SHA512 message-\ndigest operation, processing another message block, and updating\nthe context.\n\nNever throws an exception."]
    pub fn fz_sha512_update(
        state: *mut fz_sha512,
        input: *const ::std::os::raw::c_uchar,
        inlen: usize,
    );
}
extern "C" {
    #[doc = "SHA512 finalization. Ends an SHA512 message-digest operation,\nwriting the message digest and zeroizing the context.\n\nNever throws an exception."]
    pub fn fz_sha512_final(state: *mut fz_sha512, digest: *mut ::std::os::raw::c_uchar);
}
#[doc = "Structure definition is public to enable stack\nbased allocation. Do not access the members directly."]
pub type fz_sha384 = fz_sha512;
extern "C" {
    #[doc = "SHA384 initialization. Begins an SHA384 operation, initialising\nthe supplied context.\n\nNever throws an exception."]
    pub fn fz_sha384_init(state: *mut fz_sha384);
}
extern "C" {
    #[doc = "SHA384 block update operation. Continues an SHA384 message-\ndigest operation, processing another message block, and updating\nthe context.\n\nNever throws an exception."]
    pub fn fz_sha384_update(
        state: *mut fz_sha384,
        input: *const ::std::os::raw::c_uchar,
        inlen: usize,
    );
}
extern "C" {
    #[doc = "SHA384 finalization. Ends an SHA384 message-digest operation,\nwriting the message digest and zeroizing the context.\n\nNever throws an exception."]
    pub fn fz_sha384_final(state: *mut fz_sha384, digest: *mut ::std::os::raw::c_uchar);
}
#[doc = "Structure definition is public to enable stack\nbased allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_arc4 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub state: [::std::os::raw::c_uchar; 256usize],
}
#[test]
fn bindgen_test_layout_fz_arc4() {
    const UNINIT: ::std::mem::MaybeUninit<fz_arc4> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_arc4>(),
        264usize,
        concat!("Size of: ", stringify!(fz_arc4))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_arc4>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_arc4))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_arc4),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_arc4),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_arc4),
            "::",
            stringify!(state)
        )
    );
}
extern "C" {
    #[doc = "RC4 initialization. Begins an RC4 operation, writing a new\ncontext.\n\nNever throws an exception."]
    pub fn fz_arc4_init(state: *mut fz_arc4, key: *const ::std::os::raw::c_uchar, len: usize);
}
extern "C" {
    #[doc = "RC4 block encrypt operation; encrypt src into dst (both of\nlength len) updating the RC4 state as we go.\n\nNever throws an exception."]
    pub fn fz_arc4_encrypt(
        state: *mut fz_arc4,
        dest: *mut ::std::os::raw::c_uchar,
        src: *const ::std::os::raw::c_uchar,
        len: usize,
    );
}
extern "C" {
    #[doc = "RC4 finalization. Zero the context.\n\nNever throws an exception."]
    pub fn fz_arc4_final(state: *mut fz_arc4);
}
#[doc = "Structure definitions are public to enable stack\nbased allocation. Do not access the members directly."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_aes {
    pub nr: ::std::os::raw::c_int,
    pub rk: *mut u32,
    pub buf: [u32; 68usize],
}
#[test]
fn bindgen_test_layout_fz_aes() {
    const UNINIT: ::std::mem::MaybeUninit<fz_aes> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_aes>(),
        288usize,
        concat!("Size of: ", stringify!(fz_aes))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_aes>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_aes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_aes),
            "::",
            stringify!(nr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rk) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_aes),
            "::",
            stringify!(rk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_aes),
            "::",
            stringify!(buf)
        )
    );
}
extern "C" {
    #[doc = "AES encryption initialization. Fills in the supplied context\nand prepares for encryption using the given key.\n\nReturns non-zero for error (key size other than 128/192/256).\n\nNever throws an exception."]
    pub fn fz_aes_setkey_enc(
        ctx: *mut fz_aes,
        key: *const ::std::os::raw::c_uchar,
        keysize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "AES decryption initialization. Fills in the supplied context\nand prepares for decryption using the given key.\n\nReturns non-zero for error (key size other than 128/192/256).\n\nNever throws an exception."]
    pub fn fz_aes_setkey_dec(
        ctx: *mut fz_aes,
        key: *const ::std::os::raw::c_uchar,
        keysize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "AES block processing. Encrypts or Decrypts (according to mode,\nwhich must match what was initially set up) length bytes (which\nmust be a multiple of 16), using (and modifying) the insertion\nvector iv, reading from input, and writing to output.\n\nNever throws an exception."]
    pub fn fz_aes_crypt_cbc(
        ctx: *mut fz_aes,
        mode: ::std::os::raw::c_int,
        length: usize,
        iv: *mut ::std::os::raw::c_uchar,
        input: *const ::std::os::raw::c_uchar,
        output: *mut ::std::os::raw::c_uchar,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_getopt_long_options {
    pub option: *mut ::std::os::raw::c_char,
    pub flag: *mut ::std::os::raw::c_int,
    pub opaque: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_fz_getopt_long_options() {
    const UNINIT: ::std::mem::MaybeUninit<fz_getopt_long_options> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_getopt_long_options>(),
        24usize,
        concat!("Size of: ", stringify!(fz_getopt_long_options))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_getopt_long_options>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_getopt_long_options))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).option) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_getopt_long_options),
            "::",
            stringify!(option)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_getopt_long_options),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_getopt_long_options),
            "::",
            stringify!(opaque)
        )
    );
}
extern "C" {
    #[doc = "Simple functions/variables for use in tools.\n\nostr = option string. Comprises single letter options, followed by : if there\nis an argument to the option.\n\nlongopts: NULL (indicating no long options), or a pointer to an array of\nlongoptions, terminated by an entry with option == NULL.\n\nIn the event of matching a single char option, this function will normally\nreturn the char. The exception to this is when the option requires an\nargument and none is supplied; in this case we return ':'.\n\nIn the event of matching a long option, this function returns 0, with fz_optlong\nset to point to the matching option.\n\nA long option entry may be followed with : to indicate there is an argument to the\noption. If the need for an argument is specified in this way, and no argument is\ngiven, an error will be displayed and argument processing will stop. If an argument\nis given, and the long option record contains a non-null flag pointer, then the code\nwill decode the argument and fill in that flag pointer. Specifically,\ncase-insensitive matches to 'yes', 'no', 'true' and 'false' will cause a value of 0\nor 1 as appropriate to be written; failing this the arg will be interpreted as a\ndecimal integer using atoi.\n\nA long option entry may be followed by an list of options (e.g. myoption=foo|bar|baz)\nand the option will be passed to fz_opt_from_list. The return value of that will be\nplaced in fz_optitem. If the return value of that function is -1, then an error will\nbe displayed and argument processing will stop.\n\nIn the event of reaching the end of the arg list or '--', this function returns EOF.\n\nIn the event of failing to match anything, an error is printed, and we return '?'.\n\nIf an argument is expected for the option, then fz_optarg will be returned pointing\nat the start of the argument. Examples of supported argument formats: '-r500', '-r 500',\n'--resolution 500', '--resolution=500'."]
    pub fn fz_getopt_long(
        nargc: ::std::os::raw::c_int,
        nargv: *const *mut ::std::os::raw::c_char,
        ostr: *const ::std::os::raw::c_char,
        longopts: *const fz_getopt_long_options,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Identical to fz_getopt_long, but with a NULL longopts field, signifying no long\noptions."]
    pub fn fz_getopt(
        nargc: ::std::os::raw::c_int,
        nargv: *const *mut ::std::os::raw::c_char,
        ostr: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Return the index of a (case-insensitive) option within an optlist.\n\nFor instance for optlist = \"Foo|Bar|Baz\", and  opt = \"bar\",\nthis would return 1.\n\nIf the optlist ends with \"|*\" then that is a catch all case and\nmatches all options allowing the caller to process it itself.\nfz_optarg will be set to point to the option, and the return\nvalue will be the index of the '*' option within that list.\n\nIf an optlist entry ends with ':' (e.g. \"Foo:\") then that option\nmay have suboptions appended to it (for example \"JPG:80\") and\nfz_optarg will be set to point at \"80\". Otherwise fz_optarg will\nbe set to NULL.\n\nIn the event of no-match found, prints an error and returns -1."]
    pub fn fz_opt_from_list(
        opt: *mut ::std::os::raw::c_char,
        optlist: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Convert \"-\" to \"/dev/stdout\" for use with command lines.\nAlso converts \"nul\" and \"con\" on Windows."]
    pub fn fz_optpath(opt: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_hash_table {
    _unused: [u8; 0],
}
#[doc = "Function type called when a hash table entry is dropped.\n\nOnly used when the entire hash table is dropped."]
pub type fz_hash_table_drop_fn = ::std::option::Option<
    unsafe extern "C" fn(ctx: *mut fz_context, val: *mut ::std::os::raw::c_void),
>;
extern "C" {
    #[doc = "Create a new hash table.\n\ninitialsize: The initial size of the hashtable. The hashtable\nmay grow (double in size) if it starts to get crowded (80%\nfull).\n\nkeylen: byte length for each key.\n\nlock: -1 for no lock, otherwise the FZ_LOCK to use to protect\nthis table.\n\ndrop_val: Function to use to destroy values on table drop."]
    pub fn fz_new_hash_table(
        ctx: *mut fz_context,
        initialsize: ::std::os::raw::c_int,
        keylen: ::std::os::raw::c_int,
        lock: ::std::os::raw::c_int,
        drop_val: fz_hash_table_drop_fn,
    ) -> *mut fz_hash_table;
}
extern "C" {
    #[doc = "Destroy the hash table.\n\nValues are dropped using the drop function."]
    pub fn fz_drop_hash_table(ctx: *mut fz_context, table: *mut fz_hash_table);
}
extern "C" {
    #[doc = "Search for a matching hash within the table, and return the\nassociated value."]
    pub fn fz_hash_find(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        key: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Insert a new key/value pair into the hash table.\n\nIf an existing entry with the same key is found, no change is\nmade to the hash table, and a pointer to the existing value is\nreturned.\n\nIf no existing entry with the same key is found, ownership of\nval passes in, key is copied, and NULL is returned."]
    pub fn fz_hash_insert(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        key: *const ::std::os::raw::c_void,
        val: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Remove the entry for a given key.\n\nThe value is NOT freed, so the caller is expected to take care\nof this."]
    pub fn fz_hash_remove(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        key: *const ::std::os::raw::c_void,
    );
}
#[doc = "Callback function called on each key/value pair in the hash\ntable, when fz_hash_for_each is run."]
pub type fz_hash_table_for_each_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        state: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_void,
        keylen: ::std::os::raw::c_int,
        val: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    #[doc = "Iterate over the entries in a hash table."]
    pub fn fz_hash_for_each(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        state: *mut ::std::os::raw::c_void,
        callback: fz_hash_table_for_each_fn,
    );
}
#[doc = "Callback function called on each key/value pair in the hash\ntable, when fz_hash_filter is run to remove entries where the\ncallback returns true."]
pub type fz_hash_table_filter_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        state: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_void,
        keylen: ::std::os::raw::c_int,
        val: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = "Iterate over the entries in a hash table, removing all the ones where callback returns true.\nDoes NOT free the value of the entry, so the caller is expected to take care of this."]
    pub fn fz_hash_filter(
        ctx: *mut fz_context,
        table: *mut fz_hash_table,
        state: *mut ::std::os::raw::c_void,
        callback: fz_hash_table_filter_fn,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_tree {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = "Look for the value of a node in the tree with the given key.\n\nSimple pointer equivalence is used for key.\n\nReturns NULL for no match."]
    pub fn fz_tree_lookup(
        ctx: *mut fz_context,
        node: *mut fz_tree,
        key: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Insert a new key/value pair and rebalance the tree.\nReturn the new root of the tree after inserting and rebalancing.\nMay be called with a NULL root to create a new tree.\n\nNo data is copied into the tree structure; key and value are\nmerely kept as pointers."]
    pub fn fz_tree_insert(
        ctx: *mut fz_context,
        root: *mut fz_tree,
        key: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_void,
    ) -> *mut fz_tree;
}
extern "C" {
    #[doc = "Drop the tree.\n\nThe storage used by the tree is freed, and each value has\ndropfunc called on it."]
    pub fn fz_drop_tree(
        ctx: *mut fz_context,
        node: *mut fz_tree,
        dropfunc: ::std::option::Option<
            unsafe extern "C" fn(ctx: *mut fz_context, value: *mut ::std::os::raw::c_void),
        >,
    );
}
pub const fz_bidi_direction_FZ_BIDI_LTR: fz_bidi_direction = 0;
pub const fz_bidi_direction_FZ_BIDI_RTL: fz_bidi_direction = 1;
pub const fz_bidi_direction_FZ_BIDI_NEUTRAL: fz_bidi_direction = 2;
pub const fz_bidi_direction_FZ_BIDI_UNSET: fz_bidi_direction = 3;
pub type fz_bidi_direction = ::std::os::raw::c_uint;
pub const fz_bidi_flags_FZ_BIDI_CLASSIFY_WHITE_SPACE: fz_bidi_flags = 1;
pub const fz_bidi_flags_FZ_BIDI_REPLACE_TAB: fz_bidi_flags = 2;
pub type fz_bidi_flags = ::std::os::raw::c_uint;
#[doc = "Prototype for callback function supplied to fz_bidi_fragment_text.\n\n@param\tfragment\tfirst character in fragment\n@param\tfragmentLen\tnumber of characters in fragment\n@param\tbidiLevel\tThe bidirectional level for this text.\nThe bottom bit will be set iff block\nshould concatenate with other blocks as\nright-to-left\n@param\tscript\t\tthe script in use for this fragment (other\nthan common or inherited)\n@param\targ\t\tdata from caller of Bidi_fragmentText"]
pub type fz_bidi_fragment_fn = ::std::option::Option<
    unsafe extern "C" fn(
        fragment: *const u32,
        fragmentLen: usize,
        bidiLevel: ::std::os::raw::c_int,
        script: ::std::os::raw::c_int,
        arg: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    #[doc = "Partitions the given Unicode sequence into one or more\nunidirectional fragments and invokes the given callback\nfunction for each fragment.\n\nFor example, if directionality of text is:\n0123456789\nrrlllrrrrr,\nwe'll invoke callback with:\n&text[0], length == 2\n&text[2], length == 3\n&text[5], length == 5\n\n@param[in] text\tstart of Unicode sequence\n@param[in] textlen   number of Unicodes to analyse\n@param[in] baseDir   direction of paragraph (specify FZ_BIDI_NEUTRAL to force auto-detection)\n@param[in] callback  function to be called for each fragment\n@param[in] arg\tdata to be passed to the callback function\n@param[in] flags     flags to control operation (see fz_bidi_flags above)"]
    pub fn fz_bidi_fragment_text(
        ctx: *mut fz_context,
        text: *const u32,
        textlen: usize,
        baseDir: *mut fz_bidi_direction,
        callback: fz_bidi_fragment_fn,
        arg: *mut ::std::os::raw::c_void,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Open a zip or tar archive\n\nOpen a file and identify its archive type based on the archive\nsignature contained inside.\n\nfilename: a path to a file as it would be given to open(2)."]
    pub fn fz_open_archive(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open zip or tar archive stream.\n\nOpen an archive using a seekable stream object rather than\nopening a file or directory on disk."]
    pub fn fz_open_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open zip or tar archive stream.\n\nDoes the same as fz_open_archive_with_stream, but will not throw\nan error in the event of failing to recognise the format. Will\nstill throw errors in other cases though!"]
    pub fn fz_try_open_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open a directory as if it was an archive.\n\nA special case where a directory is opened as if it was an\narchive.\n\nNote that for directories it is not possible to retrieve the\nnumber of entries or list the entries. It is however possible\nto check if the archive has a particular entry.\n\npath: a path to a directory as it would be given to opendir(3)."]
    pub fn fz_open_directory(
        ctx: *mut fz_context,
        path: *const ::std::os::raw::c_char,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Determine if a given path is a directory.\n\nIn the case of the path not existing, or having no access\nwe will return 0."]
    pub fn fz_is_directory(
        ctx: *mut fz_context,
        path: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Drop a reference to an archive.\n\nWhen the last reference is dropped, this closes and releases\nany memory or filehandles associated with the archive."]
    pub fn fz_drop_archive(ctx: *mut fz_context, arch: *mut fz_archive);
}
extern "C" {
    #[doc = "Keep a reference to an archive."]
    pub fn fz_keep_archive(ctx: *mut fz_context, arch: *mut fz_archive) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Return a pointer to a string describing the format of the\narchive.\n\nThe lifetime of the string is unspecified (in current\nimplementations the string will persist until the archive\nis closed, but this is not guaranteed)."]
    pub fn fz_archive_format(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Number of entries in archive.\n\nWill always return a value >= 0.\n\nMay throw an exception if this type of archive cannot count the\nentries (such as a directory)."]
    pub fn fz_count_archive_entries(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Get listed name of entry position idx.\n\nidx: Must be a value >= 0 < return value from\nfz_count_archive_entries. If not in range NULL will be\nreturned.\n\nMay throw an exception if this type of archive cannot list the\nentries (such as a directory)."]
    pub fn fz_list_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        idx: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Check if entry by given name exists.\n\nIf named entry does not exist 0 will be returned, if it does\nexist 1 is returned.\n\nname: Entry name to look for, this must be an exact match to\nthe entry name in the archive."]
    pub fn fz_has_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Opens an archive entry as a stream.\n\nname: Entry name to look for, this must be an exact match to\nthe entry name in the archive.\n\nThrows an exception if a matching entry cannot be found."]
    pub fn fz_open_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::std::os::raw::c_char,
    ) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Opens an archive entry as a stream.\n\nReturns NULL if a matching entry cannot be found, otherwise\nbehaves exactly as fz_open_archive_entry."]
    pub fn fz_try_open_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::std::os::raw::c_char,
    ) -> *mut fz_stream;
}
extern "C" {
    #[doc = "Reads all bytes in an archive entry\ninto a buffer.\n\nname: Entry name to look for, this must be an exact match to\nthe entry name in the archive.\n\nThrows an exception if a matching entry cannot be found."]
    pub fn fz_read_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::std::os::raw::c_char,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Reads all bytes in an archive entry\ninto a buffer.\n\nname: Entry name to look for, this must be an exact match to\nthe entry name in the archive.\n\nReturns NULL if a matching entry cannot be found. Otherwise behaves\nthe same as fz_read_archive_entry. Exceptions may be thrown."]
    pub fn fz_try_read_archive_entry(
        ctx: *mut fz_context,
        arch: *mut fz_archive,
        name: *const ::std::os::raw::c_char,
    ) -> *mut fz_buffer;
}
extern "C" {
    #[doc = "Detect if stream object is a tar archive.\n\nAssumes that the stream object is seekable."]
    pub fn fz_is_tar_archive(ctx: *mut fz_context, file: *mut fz_stream) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Detect if stream object is an archive supported by libarchive.\n\nAssumes that the stream object is seekable."]
    pub fn fz_is_libarchive_archive(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Detect if stream object is a cfb archive.\n\nAssumes that the stream object is seekable."]
    pub fn fz_is_cfb_archive(ctx: *mut fz_context, file: *mut fz_stream) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Open a tar archive file.\n\nAn exception is thrown if the file is not a tar archive as\nindicated by the presence of a tar signature.\n\nfilename: a path to a tar archive file as it would be given to\nopen(2)."]
    pub fn fz_open_tar_archive(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open a tar archive stream.\n\nOpen an archive using a seekable stream object rather than\nopening a file or directory on disk.\n\nAn exception is thrown if the stream is not a tar archive as\nindicated by the presence of a tar signature."]
    pub fn fz_open_tar_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open an archive using libarchive.\n\nAn exception is thrown if the file is not supported by libarchive.\n\nfilename: a path to an archive file as it would be given to\nopen(2)."]
    pub fn fz_open_libarchive_archive(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open an archive using libarchive.\n\nOpen an archive using a seekable stream object rather than\nopening a file or directory on disk.\n\nAn exception is thrown if the stream is not supported by libarchive."]
    pub fn fz_open_libarchive_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open a cfb file as an archive.\n\nAn exception is thrown if the file is not recognised as a cfb.\n\nfilename: a path to an archive file as it would be given to\nopen(2)."]
    pub fn fz_open_cfb_archive(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open a cfb file as an archive.\n\nOpen an archive using a seekable stream object rather than\nopening a file or directory on disk.\n\nAn exception is thrown if the file is not recognised as a chm."]
    pub fn fz_open_cfb_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Detect if stream object is a zip archive.\n\nAssumes that the stream object is seekable."]
    pub fn fz_is_zip_archive(ctx: *mut fz_context, file: *mut fz_stream) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Open a zip archive file.\n\nAn exception is thrown if the file is not a zip archive as\nindicated by the presence of a zip signature.\n\nfilename: a path to a zip archive file as it would be given to\nopen(2)."]
    pub fn fz_open_zip_archive(
        ctx: *mut fz_context,
        path: *const ::std::os::raw::c_char,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open a zip archive stream.\n\nOpen an archive using a seekable stream object rather than\nopening a file or directory on disk.\n\nAn exception is thrown if the stream is not a zip archive as\nindicated by the presence of a zip signature."]
    pub fn fz_open_zip_archive_with_stream(
        ctx: *mut fz_context,
        file: *mut fz_stream,
    ) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Open a zip archive from static data."]
    pub fn fz_open_zip_archive_with_memory(
        ctx: *mut fz_context,
        data: *const ::std::os::raw::c_uchar,
        size: usize,
    ) -> *mut fz_archive;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_zip_writer {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = "Create a new zip writer that writes to a given file.\n\nOpen an archive using a seekable stream object rather than\nopening a file or directory on disk."]
    pub fn fz_new_zip_writer(
        ctx: *mut fz_context,
        filename: *const ::std::os::raw::c_char,
    ) -> *mut fz_zip_writer;
}
extern "C" {
    #[doc = "Create a new zip writer that writes to a given output stream.\n\nOwnership of out passes in immediately upon calling this function.\nThe caller should never drop the fz_output, even if this function throws\nan exception."]
    pub fn fz_new_zip_writer_with_output(
        ctx: *mut fz_context,
        out: *mut fz_output,
    ) -> *mut fz_zip_writer;
}
extern "C" {
    #[doc = "Given a buffer of data, (optionally) compress it, and add it to\nthe zip file with the given name."]
    pub fn fz_write_zip_entry(
        ctx: *mut fz_context,
        zip: *mut fz_zip_writer,
        name: *const ::std::os::raw::c_char,
        buf: *mut fz_buffer,
        compress: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Close the zip file for writing.\n\nThis flushes any pending data to the file. This can throw\nexceptions."]
    pub fn fz_close_zip_writer(ctx: *mut fz_context, zip: *mut fz_zip_writer);
}
extern "C" {
    #[doc = "Drop the reference to the zipfile.\n\nIn common with other 'drop' methods, this will never throw an\nexception."]
    pub fn fz_drop_zip_writer(ctx: *mut fz_context, zip: *mut fz_zip_writer);
}
extern "C" {
    #[doc = "Create an archive that holds named buffers.\n\ntree can either be a preformed tree with fz_buffers as values,\nor it can be NULL for an empty tree."]
    pub fn fz_new_tree_archive(ctx: *mut fz_context, tree: *mut fz_tree) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Add a named buffer to an existing tree archive.\n\nThe tree will take a new reference to the buffer. Ownership\nis not transferred."]
    pub fn fz_tree_archive_add_buffer(
        ctx: *mut fz_context,
        arch_: *mut fz_archive,
        name: *const ::std::os::raw::c_char,
        buf: *mut fz_buffer,
    );
}
extern "C" {
    #[doc = "Add a named block of data to an existing tree archive.\n\nThe data will be copied into a buffer, and so the caller\nmay free it as soon as this returns."]
    pub fn fz_tree_archive_add_data(
        ctx: *mut fz_context,
        arch_: *mut fz_archive,
        name: *const ::std::os::raw::c_char,
        data: *const ::std::os::raw::c_void,
        size: usize,
    );
}
extern "C" {
    #[doc = "Create a new multi archive (initially empty)."]
    pub fn fz_new_multi_archive(ctx: *mut fz_context) -> *mut fz_archive;
}
extern "C" {
    #[doc = "Add an archive to the set of archives handled by a multi\narchive.\n\nIf path is NULL, then the archive contents will appear at the\ntop level, otherwise, the archives contents will appear prefixed\nby path."]
    pub fn fz_mount_multi_archive(
        ctx: *mut fz_context,
        arch_: *mut fz_archive,
        sub: *mut fz_archive,
        path: *const ::std::os::raw::c_char,
    );
}
pub type fz_recognize_archive_fn = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut fz_context, arg2: *mut fz_stream) -> ::std::os::raw::c_int,
>;
pub type fz_open_archive_fn = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut fz_context, arg2: *mut fz_stream) -> *mut fz_archive,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_archive_handler {
    pub recognize: fz_recognize_archive_fn,
    pub open: fz_open_archive_fn,
}
#[test]
fn bindgen_test_layout_fz_archive_handler() {
    const UNINIT: ::std::mem::MaybeUninit<fz_archive_handler> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_archive_handler>(),
        16usize,
        concat!("Size of: ", stringify!(fz_archive_handler))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_archive_handler>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_archive_handler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recognize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive_handler),
            "::",
            stringify!(recognize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).open) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive_handler),
            "::",
            stringify!(open)
        )
    );
}
extern "C" {
    pub fn fz_register_archive_handler(ctx: *mut fz_context, handler: *const fz_archive_handler);
}
#[doc = "Implementation details: Subject to change."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_archive {
    pub refs: ::std::os::raw::c_int,
    pub file: *mut fz_stream,
    pub format: *const ::std::os::raw::c_char,
    pub drop_archive:
        ::std::option::Option<unsafe extern "C" fn(ctx: *mut fz_context, arch: *mut fz_archive)>,
    pub count_entries: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, arch: *mut fz_archive) -> ::std::os::raw::c_int,
    >,
    pub list_entry: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arch: *mut fz_archive,
            idx: ::std::os::raw::c_int,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub has_entry: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arch: *mut fz_archive,
            name: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub read_entry: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arch: *mut fz_archive,
            name: *const ::std::os::raw::c_char,
        ) -> *mut fz_buffer,
    >,
    pub open_entry: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            arch: *mut fz_archive,
            name: *const ::std::os::raw::c_char,
        ) -> *mut fz_stream,
    >,
}
#[test]
fn bindgen_test_layout_fz_archive() {
    const UNINIT: ::std::mem::MaybeUninit<fz_archive> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_archive>(),
        72usize,
        concat!("Size of: ", stringify!(fz_archive))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_archive>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_archive))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive),
            "::",
            stringify!(refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drop_archive) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive),
            "::",
            stringify!(drop_archive)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count_entries) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive),
            "::",
            stringify!(count_entries)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).list_entry) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive),
            "::",
            stringify!(list_entry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_entry) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive),
            "::",
            stringify!(has_entry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_entry) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive),
            "::",
            stringify!(read_entry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).open_entry) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_archive),
            "::",
            stringify!(open_entry)
        )
    );
}
extern "C" {
    pub fn fz_new_archive_of_size(
        ctx: *mut fz_context,
        file: *mut fz_stream,
        size: ::std::os::raw::c_int,
    ) -> *mut fz_archive;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_xml {
    _unused: [u8; 0],
}
pub type fz_xml_doc = fz_xml;
extern "C" {
    #[doc = "Parse the contents of buffer into a tree of xml nodes.\n\npreserve_white: whether to keep or delete all-whitespace nodes."]
    pub fn fz_parse_xml(
        ctx: *mut fz_context,
        buf: *mut fz_buffer,
        preserve_white: ::std::os::raw::c_int,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Parse the contents of buffer into a tree of xml nodes.\n\npreserve_white: whether to keep or delete all-whitespace nodes."]
    pub fn fz_parse_xml_stream(
        ctx: *mut fz_context,
        stream: *mut fz_stream,
        preserve_white: ::std::os::raw::c_int,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Parse the contents of an archive entry into a tree of xml nodes.\n\npreserve_white: whether to keep or delete all-whitespace nodes."]
    pub fn fz_parse_xml_archive_entry(
        ctx: *mut fz_context,
        dir: *mut fz_archive,
        filename: *const ::std::os::raw::c_char,
        preserve_white: ::std::os::raw::c_int,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Try and parse the contents of an archive entry into a tree of xml nodes.\n\npreserve_white: whether to keep or delete all-whitespace nodes.\n\nWill return NULL if the archive entry can't be found. Otherwise behaves\nthe same as fz_parse_xml_archive_entry. May throw exceptions."]
    pub fn fz_try_parse_xml_archive_entry(
        ctx: *mut fz_context,
        dir: *mut fz_archive,
        filename: *const ::std::os::raw::c_char,
        preserve_white: ::std::os::raw::c_int,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Parse the contents of a buffer into a tree of XML nodes,\nusing the HTML5 parsing algorithm."]
    pub fn fz_parse_xml_from_html5(ctx: *mut fz_context, buf: *mut fz_buffer) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Add a reference to the XML."]
    pub fn fz_keep_xml(ctx: *mut fz_context, xml: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Drop a reference to the XML. When the last reference is\ndropped, the node and all its children and siblings will\nbe freed."]
    pub fn fz_drop_xml(ctx: *mut fz_context, xml: *mut fz_xml);
}
extern "C" {
    #[doc = "Detach a node from the tree, unlinking it from its parent,\nand setting the document root to the node."]
    pub fn fz_detach_xml(ctx: *mut fz_context, node: *mut fz_xml);
}
extern "C" {
    #[doc = "Return the topmost XML node of a document."]
    pub fn fz_xml_root(xml: *mut fz_xml_doc) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return previous sibling of XML node."]
    pub fn fz_xml_prev(item: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return next sibling of XML node."]
    pub fn fz_xml_next(item: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return parent of XML node."]
    pub fn fz_xml_up(item: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return first child of XML node."]
    pub fn fz_xml_down(item: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return true if the tag name matches."]
    pub fn fz_xml_is_tag(
        item: *mut fz_xml,
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Return tag of XML node. Return NULL for text nodes."]
    pub fn fz_xml_tag(item: *mut fz_xml) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Return the value of an attribute of an XML node.\nNULL if the attribute doesn't exist."]
    pub fn fz_xml_att(
        item: *mut fz_xml,
        att: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Return the value of an attribute of an XML node.\nIf the first attribute doesn't exist, try the second.\nNULL if neither attribute exists."]
    pub fn fz_xml_att_alt(
        item: *mut fz_xml,
        one: *const ::std::os::raw::c_char,
        two: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Check for a matching attribute on an XML node.\n\nIf the node has the requested attribute (name), and the value\nmatches (match) then return 1. Otherwise, 0."]
    pub fn fz_xml_att_eq(
        item: *mut fz_xml,
        name: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Add an attribute to an XML node."]
    pub fn fz_xml_add_att(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        node: *mut fz_xml,
        key: *const ::std::os::raw::c_char,
        val: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Return the text content of an XML node.\nReturn NULL if the node is a tag."]
    pub fn fz_xml_text(item: *mut fz_xml) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Pretty-print an XML tree to given output."]
    pub fn fz_output_xml(
        ctx: *mut fz_context,
        out: *mut fz_output,
        item: *mut fz_xml,
        level: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "Pretty-print an XML tree to stdout. (Deprecated, use\nfz_output_xml in preference)."]
    pub fn fz_debug_xml(item: *mut fz_xml, level: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = "Search the siblings of XML nodes starting with item looking for\nthe first with the given tag.\n\nReturn NULL if none found."]
    pub fn fz_xml_find(item: *mut fz_xml, tag: *const ::std::os::raw::c_char) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Search the siblings of XML nodes starting with the first sibling\nof item looking for the first with the given tag.\n\nReturn NULL if none found."]
    pub fn fz_xml_find_next(item: *mut fz_xml, tag: *const ::std::os::raw::c_char) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Search the siblings of XML nodes starting with the first child\nof item looking for the first with the given tag.\n\nReturn NULL if none found."]
    pub fn fz_xml_find_down(item: *mut fz_xml, tag: *const ::std::os::raw::c_char) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Search the siblings of XML nodes starting with item looking for\nthe first with the given tag (or any tag if tag is NULL), and\nwith a matching attribute.\n\nReturn NULL if none found."]
    pub fn fz_xml_find_match(
        item: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
        att: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Search the siblings of XML nodes starting with the first sibling\nof item looking for the first with the given tag (or any tag if tag\nis NULL), and with a matching attribute.\n\nReturn NULL if none found."]
    pub fn fz_xml_find_next_match(
        item: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
        att: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Search the siblings of XML nodes starting with the first child\nof item looking for the first with the given tag (or any tag if\ntag is NULL), and with a matching attribute.\n\nReturn NULL if none found."]
    pub fn fz_xml_find_down_match(
        item: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
        att: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Perform a depth first search from item, returning the first\nchild that matches the given tag (or any tag if tag is NULL),\nwith the given attribute (if att is non NULL), that matches\nmatch (if match is non NULL)."]
    pub fn fz_xml_find_dfs(
        item: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
        att: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Perform a depth first search from item, returning the first\nchild that matches the given tag (or any tag if tag is NULL),\nwith the given attribute (if att is non NULL), that matches\nmatch (if match is non NULL). The search stops if it ever\nreaches the top of the tree, or the declared 'top' item."]
    pub fn fz_xml_find_dfs_top(
        item: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
        att: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
        top: *mut fz_xml,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Perform a depth first search onwards from item, returning the first\nchild that matches the given tag (or any tag if tag is NULL),\nwith the given attribute (if att is non NULL), that matches\nmatch (if match is non NULL)."]
    pub fn fz_xml_find_next_dfs(
        item: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
        att: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Perform a depth first search onwards from item, returning the first\nchild that matches the given tag (or any tag if tag is NULL),\nwith the given attribute (if att is non NULL), that matches\nmatch (if match is non NULL). The search stops if it ever reaches\nthe top of the tree, or the declared 'top' item."]
    pub fn fz_xml_find_next_dfs_top(
        item: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
        att: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
        top: *mut fz_xml,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Extract and concatenate all plain text data from XML tree into a new string."]
    pub fn fz_new_text_from_xml(
        ctx: *mut fz_context,
        root: *mut fz_xml,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Return a borrowed reference for the 'body' element of\nthe given DOM."]
    pub fn fz_dom_body(ctx: *mut fz_context, dom: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return a borrowed reference for the document (the top\nlevel element) of the DOM."]
    pub fn fz_dom_document_element(ctx: *mut fz_context, dom: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Create an element of a given tag type for the given DOM.\n\nThe element is not linked into the DOM yet."]
    pub fn fz_dom_create_element(
        ctx: *mut fz_context,
        dom: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Create a text node for the given DOM.\n\nThe element is not linked into the DOM yet."]
    pub fn fz_dom_create_text_node(
        ctx: *mut fz_context,
        dom: *mut fz_xml,
        text: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Find the first element matching the requirements in a depth first traversal from elt.\n\nThe tagname must match tag, unless tag is NULL, when all tag names are considered to match.\n\nIf att is NULL, then all tags match.\nOtherwise:\nIf match is NULL, then only nodes that have an att attribute match.\nIf match is non-NULL, then only nodes that have an att attribute that matches match match.\n\nReturns NULL (if no match found), or a borrowed reference to the first matching element."]
    pub fn fz_dom_find(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
        att: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Find the next element matching the requirements."]
    pub fn fz_dom_find_next(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
        att: *const ::std::os::raw::c_char,
        match_: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Insert an element as the last child of a parent, unlinking the\nchild from its current position if required."]
    pub fn fz_dom_append_child(ctx: *mut fz_context, parent: *mut fz_xml, child: *mut fz_xml);
}
extern "C" {
    #[doc = "Insert an element (new_elt), before another element (node),\nunlinking the new_elt from its current position if required."]
    pub fn fz_dom_insert_before(ctx: *mut fz_context, node: *mut fz_xml, new_elt: *mut fz_xml);
}
extern "C" {
    #[doc = "Insert an element (new_elt), after another element (node),\nunlinking the new_elt from its current position if required."]
    pub fn fz_dom_insert_after(ctx: *mut fz_context, node: *mut fz_xml, new_elt: *mut fz_xml);
}
extern "C" {
    #[doc = "Remove an element from the DOM. The element can be added back elsewhere\nif required.\n\nNo reference counting changes for the element."]
    pub fn fz_dom_remove(ctx: *mut fz_context, elt: *mut fz_xml);
}
extern "C" {
    #[doc = "Clone an element (and its children).\n\nA borrowed reference to the clone is returned. The clone is not\nyet linked into the DOM."]
    pub fn fz_dom_clone(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return a borrowed reference to the first child of a node,\nor NULL if there isn't one."]
    pub fn fz_dom_first_child(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return a borrowed reference to the parent of a node,\nor NULL if there isn't one."]
    pub fn fz_dom_parent(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return a borrowed reference to the next sibling of a node,\nor NULL if there isn't one."]
    pub fn fz_dom_next(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Return a borrowed reference to the previous sibling of a node,\nor NULL if there isn't one."]
    pub fn fz_dom_previous(ctx: *mut fz_context, elt: *mut fz_xml) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Add an attribute to an element.\n\nOwnership of att and value remain with the caller."]
    pub fn fz_dom_add_attribute(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        att: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Remove an attribute from an element."]
    pub fn fz_dom_remove_attribute(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        att: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Retrieve the value of a given attribute from a given element.\n\nReturns a borrowed pointer to the value or NULL if not found."]
    pub fn fz_dom_attribute(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        att: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Enumerate through the attributes of an element.\n\nCall with i=0,1,2,3... to enumerate attributes.\n\nOn return *att and the return value will be NULL if there are not\nthat many attributes to read. Otherwise, *att will be filled in\nwith a borrowed pointer to the attribute name, and the return\nvalue will be a borrowed pointer to the value."]
    pub fn fz_dom_get_attribute(
        ctx: *mut fz_context,
        elt: *mut fz_xml,
        i: ::std::os::raw::c_int,
        att: *mut *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Make new xml dom root element."]
    pub fn fz_new_dom(ctx: *mut fz_context, tag: *const ::std::os::raw::c_char) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Create a new dom node.\n\nThis will NOT be linked in yet."]
    pub fn fz_new_dom_node(
        ctx: *mut fz_context,
        dom: *mut fz_xml,
        tag: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Create a new dom text node.\n\nThis will NOT be linked in yet."]
    pub fn fz_new_dom_text_node(
        ctx: *mut fz_context,
        dom: *mut fz_xml,
        text: *const ::std::os::raw::c_char,
    ) -> *mut fz_xml;
}
extern "C" {
    #[doc = "Write our xml structure out to an xml stream.\n\nProperly formatted XML is only allowed to have a single top-level node\nunder which everything must sit. Our structures allow for multiple\ntop level nodes. If required, we will output an extra 'ROOT' node\nat the top so that the xml is well-formed.\n\nIf 'indented' is non-zero then additional whitespace will be added to\nmake the XML easier to read in a text editor. It will NOT be properly\ncompliant."]
    pub fn fz_write_xml(
        ctx: *mut fz_context,
        root: *mut fz_xml,
        out: *mut fz_output,
        indented: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = "As for fz_write_xml, but direct to a file."]
    pub fn fz_save_xml(
        ctx: *mut fz_context,
        root: *mut fz_xml,
        path: *const ::std::os::raw::c_char,
        indented: ::std::os::raw::c_int,
    );
}
pub const FZ_JSON_NULL: _bindgen_ty_5 = 0;
pub const FZ_JSON_TRUE: _bindgen_ty_5 = 1;
pub const FZ_JSON_FALSE: _bindgen_ty_5 = 2;
pub const FZ_JSON_NUMBER: _bindgen_ty_5 = 3;
pub const FZ_JSON_STRING: _bindgen_ty_5 = 4;
pub const FZ_JSON_ARRAY: _bindgen_ty_5 = 5;
pub const FZ_JSON_OBJECT: _bindgen_ty_5 = 6;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_json {
    pub type_: ::std::os::raw::c_int,
    pub u: fz_json__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_json__bindgen_ty_1 {
    pub number: f64,
    pub string: *const ::std::os::raw::c_char,
    pub array: *mut fz_json_array,
    pub object: *mut fz_json_object,
}
#[test]
fn bindgen_test_layout_fz_json__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<fz_json__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_json__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(fz_json__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_json__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_json__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).number) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json__bindgen_ty_1),
            "::",
            stringify!(number)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json__bindgen_ty_1),
            "::",
            stringify!(string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json__bindgen_ty_1),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).object) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json__bindgen_ty_1),
            "::",
            stringify!(object)
        )
    );
}
#[test]
fn bindgen_test_layout_fz_json() {
    const UNINIT: ::std::mem::MaybeUninit<fz_json> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_json>(),
        16usize,
        concat!("Size of: ", stringify!(fz_json))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_json>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_json))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json),
            "::",
            stringify!(u)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_json_array {
    pub value: *mut fz_json,
    pub next: *mut fz_json_array,
}
#[test]
fn bindgen_test_layout_fz_json_array() {
    const UNINIT: ::std::mem::MaybeUninit<fz_json_array> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_json_array>(),
        16usize,
        concat!("Size of: ", stringify!(fz_json_array))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_json_array>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_json_array))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json_array),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json_array),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_json_object {
    pub key: *const ::std::os::raw::c_char,
    pub value: *mut fz_json,
    pub next: *mut fz_json_object,
}
#[test]
fn bindgen_test_layout_fz_json_object() {
    const UNINIT: ::std::mem::MaybeUninit<fz_json_object> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_json_object>(),
        24usize,
        concat!("Size of: ", stringify!(fz_json_object))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_json_object>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_json_object))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json_object),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json_object),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_json_object),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn fz_parse_json(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        s: *const ::std::os::raw::c_char,
    ) -> *mut fz_json;
}
extern "C" {
    pub fn fz_append_json(ctx: *mut fz_context, buf: *mut fz_buffer, value: *mut fz_json);
}
extern "C" {
    pub fn fz_write_json(ctx: *mut fz_context, out: *mut fz_output, value: *mut fz_json);
}
extern "C" {
    pub fn fz_json_new_null(ctx: *mut fz_context, pool: *mut fz_pool) -> *mut fz_json;
}
extern "C" {
    pub fn fz_json_new_boolean(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        x: ::std::os::raw::c_int,
    ) -> *mut fz_json;
}
extern "C" {
    pub fn fz_json_new_number(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        number: f64,
    ) -> *mut fz_json;
}
extern "C" {
    pub fn fz_json_new_string(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        string: *const ::std::os::raw::c_char,
    ) -> *mut fz_json;
}
extern "C" {
    pub fn fz_json_new_array(ctx: *mut fz_context, pool: *mut fz_pool) -> *mut fz_json;
}
extern "C" {
    pub fn fz_json_new_object(ctx: *mut fz_context, pool: *mut fz_pool) -> *mut fz_json;
}
extern "C" {
    pub fn fz_json_array_push(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        array: *mut fz_json,
        item: *mut fz_json,
    );
}
extern "C" {
    pub fn fz_json_object_set(
        ctx: *mut fz_context,
        pool: *mut fz_pool,
        object: *mut fz_json,
        key: *const ::std::os::raw::c_char,
        item: *mut fz_json,
    );
}
extern "C" {
    pub fn fz_json_is_null(ctx: *mut fz_context, json: *mut fz_json) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_json_is_boolean(ctx: *mut fz_context, json: *mut fz_json) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_json_is_number(ctx: *mut fz_context, json: *mut fz_json) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_json_is_string(ctx: *mut fz_context, json: *mut fz_json) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_json_is_array(ctx: *mut fz_context, json: *mut fz_json) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_json_is_object(ctx: *mut fz_context, json: *mut fz_json) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_json_to_boolean(ctx: *mut fz_context, json: *mut fz_json) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_json_to_number(ctx: *mut fz_context, json: *mut fz_json) -> f64;
}
extern "C" {
    pub fn fz_json_to_string(
        ctx: *mut fz_context,
        json: *mut fz_json,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fz_json_array_length(ctx: *mut fz_context, array: *mut fz_json)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_json_array_get(
        ctx: *mut fz_context,
        array: *mut fz_json,
        ix: ::std::os::raw::c_int,
    ) -> *mut fz_json;
}
extern "C" {
    pub fn fz_json_object_get(
        ctx: *mut fz_context,
        object: *mut fz_json,
        key: *const ::std::os::raw::c_char,
    ) -> *mut fz_json;
}
#[doc = "Locations within the document are referred to in terms of\nchapter and page, rather than just a page number. For some\ndocuments (such as epub documents with large numbers of pages\nbroken into many chapters) this can make navigation much faster\nas only the required chapter needs to be decoded at a time."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_location {
    pub chapter: ::std::os::raw::c_int,
    pub page: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_fz_location() {
    const UNINIT: ::std::mem::MaybeUninit<fz_location> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_location>(),
        8usize,
        concat!("Size of: ", stringify!(fz_location))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_location>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_location))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chapter) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_location),
            "::",
            stringify!(chapter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).page) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_location),
            "::",
            stringify!(page)
        )
    );
}
#[doc = "Function type for a function to drop a storable object.\n\nObjects within the store are identified by type by comparing\ntheir drop_fn pointers."]
pub type fz_store_drop_fn =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut fz_context, arg2: *mut fz_storable)>;
#[doc = "Function type for a function to check whether a storable\nobject can be dropped at the moment.\n\nReturn 0 for 'cannot be dropped', 1 otherwise."]
pub type fz_store_droppable_fn = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut fz_context, arg2: *mut fz_storable) -> ::std::os::raw::c_int,
>;
#[doc = "Any storable object should include an fz_storable structure\nat the start (by convention at least) of their structure.\n(Unless it starts with an fz_key_storable, see below)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_storable {
    pub refs: ::std::os::raw::c_int,
    pub drop: fz_store_drop_fn,
    pub droppable: fz_store_droppable_fn,
}
#[test]
fn bindgen_test_layout_fz_storable() {
    const UNINIT: ::std::mem::MaybeUninit<fz_storable> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_storable>(),
        24usize,
        concat!("Size of: ", stringify!(fz_storable))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_storable>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_storable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_storable),
            "::",
            stringify!(refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drop) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_storable),
            "::",
            stringify!(drop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).droppable) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_storable),
            "::",
            stringify!(droppable)
        )
    );
}
#[doc = "Any storable object that can appear in the key of another\nstorable object should include an fz_key_storable structure\nat the start (by convention at least) of their structure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_key_storable {
    pub storable: fz_storable,
    pub store_key_refs: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_fz_key_storable() {
    const UNINIT: ::std::mem::MaybeUninit<fz_key_storable> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_key_storable>(),
        32usize,
        concat!("Size of: ", stringify!(fz_key_storable))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_key_storable>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_key_storable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).storable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_key_storable),
            "::",
            stringify!(storable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).store_key_refs) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_key_storable),
            "::",
            stringify!(store_key_refs)
        )
    );
}
extern "C" {
    #[doc = "Increment the reference count for a storable object.\nReturns the same pointer.\n\nNever throws exceptions."]
    pub fn fz_keep_storable(
        arg1: *mut fz_context,
        arg2: *const fz_storable,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Decrement the reference count for a storable object. When the\nreference count hits zero, the drop function for that object\nis called to free the object.\n\nNever throws exceptions."]
    pub fn fz_drop_storable(arg1: *mut fz_context, arg2: *const fz_storable);
}
extern "C" {
    #[doc = "Increment the (normal) reference count for a key storable\nobject. Returns the same pointer.\n\nNever throws exceptions."]
    pub fn fz_keep_key_storable(
        arg1: *mut fz_context,
        arg2: *const fz_key_storable,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Decrement the (normal) reference count for a storable object.\nWhen the total reference count hits zero, the drop function for\nthat object is called to free the object.\n\nNever throws exceptions."]
    pub fn fz_drop_key_storable(arg1: *mut fz_context, arg2: *const fz_key_storable);
}
extern "C" {
    #[doc = "Increment the (key) reference count for a key storable\nobject. Returns the same pointer.\n\nNever throws exceptions."]
    pub fn fz_keep_key_storable_key(
        arg1: *mut fz_context,
        arg2: *const fz_key_storable,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Decrement the (key) reference count for a storable object.\nWhen the total reference count hits zero, the drop function for\nthat object is called to free the object.\n\nNever throws exceptions."]
    pub fn fz_drop_key_storable_key(arg1: *mut fz_context, arg2: *const fz_key_storable);
}
#[doc = "The store can be seen as a dictionary that maps keys to\nfz_storable values. In order to allow keys of different types to\nbe stored, we have a structure full of functions for each key\n'type'; this fz_store_type pointer is stored with each key, and\ntells the store how to perform certain operations (like taking/\ndropping a reference, comparing two keys, outputting details for\ndebugging etc).\n\nThe store uses a hash table internally for speed where possible.\nIn order for this to work, we need a mechanism for turning a\ngeneric 'key' into 'a hashable string'. For this purpose the\ntype structure contains a make_hash_key function pointer that\nmaps from a void * to a fz_store_hash structure. If\nmake_hash_key function returns 0, then the key is determined not\nto be hashable, and the value is not stored in the hash table.\n\nSome objects can be used both as values within the store, and as\na component of keys within the store. We refer to these objects\nas \"key storable\" objects. In this case, we need to take\nadditional care to ensure that we do not end up keeping an item\nwithin the store, purely because its value is referred to by\nanother key in the store.\n\nAn example of this are fz_images in PDF files. Each fz_image is\nplaced into the\tstore to enable it to be easily reused. When the\nimage is rendered, a pixmap is generated from the image, and the\npixmap is placed into the store so it can be reused on\nsubsequent renders. The image forms part of the key for the\npixmap.\n\nWhen we close the pdf document (and any associated pages/display\nlists etc), we drop the images from the store. This may leave us\nin the position of the images having non-zero reference counts\npurely because they are used as part of the keys for the\npixmaps.\n\nWe therefore use special reference counting functions to keep\ntrack of these \"key storable\" items, and hence store the number\nof references to these items that are used in keys.\n\nWhen the number of references to an object == the number of\nreferences to an object from keys in the store, we know that we\ncan remove all the items which have that object as part of the\nkey. This is done by running a pass over the store, 'reaping'\nthose items.\n\nReap passes are slower than we would like as they touch every\nitem in the store. We therefore provide a way to 'batch' such\nreap passes together, using fz_defer_reap_start/\nfz_defer_reap_end to bracket a region in which many may be\ntriggered."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_store_hash {
    pub drop: fz_store_drop_fn,
    pub u: fz_store_hash__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_store_hash__bindgen_ty_1 {
    pub pi: fz_store_hash__bindgen_ty_1__bindgen_ty_1,
    pub pir: fz_store_hash__bindgen_ty_1__bindgen_ty_2,
    pub im: fz_store_hash__bindgen_ty_1__bindgen_ty_3,
    pub link: fz_store_hash__bindgen_ty_1__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_hash__bindgen_ty_1__bindgen_ty_1 {
    pub ptr: *const ::std::os::raw::c_void,
    pub i: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_fz_store_hash__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<fz_store_hash__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(i)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_hash__bindgen_ty_1__bindgen_ty_2 {
    pub ptr: *const ::std::os::raw::c_void,
    pub i: ::std::os::raw::c_int,
    pub r: fz_irect,
}
#[test]
fn bindgen_test_layout_fz_store_hash__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<fz_store_hash__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_2>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(r)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_hash__bindgen_ty_1__bindgen_ty_3 {
    pub id: ::std::os::raw::c_int,
    pub has_shape: ::std::os::raw::c_char,
    pub has_group_alpha: ::std::os::raw::c_char,
    pub m: [f32; 4usize],
    pub ptr: *mut ::std::os::raw::c_void,
    pub doc_id: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_fz_store_hash__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<fz_store_hash__bindgen_ty_1__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_3>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_shape) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(has_shape)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_group_alpha) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(has_group_alpha)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(m)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).doc_id) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(doc_id)
        )
    );
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_hash__bindgen_ty_1__bindgen_ty_4 {
    pub src_md5: [::std::os::raw::c_uchar; 16usize],
    pub dst_md5: [::std::os::raw::c_uchar; 16usize],
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[test]
fn bindgen_test_layout_fz_store_hash__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<fz_store_hash__bindgen_ty_1__bindgen_ty_4> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_4>(),
        36usize,
        concat!(
            "Size of: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<fz_store_hash__bindgen_ty_1__bindgen_ty_4>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src_md5) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(src_md5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dst_md5) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(dst_md5)
        )
    );
}
impl fz_store_hash__bindgen_ty_1__bindgen_ty_4 {
    #[inline]
    pub fn ri(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_ri(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn bp(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bp(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn format(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_format(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn proof(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_proof(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn src_extras(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_src_extras(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn dst_extras(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_dst_extras(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn copy_spots(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_copy_spots(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bgr(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bgr(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ri: ::std::os::raw::c_uint,
        bp: ::std::os::raw::c_uint,
        format: ::std::os::raw::c_uint,
        proof: ::std::os::raw::c_uint,
        src_extras: ::std::os::raw::c_uint,
        dst_extras: ::std::os::raw::c_uint,
        copy_spots: ::std::os::raw::c_uint,
        bgr: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let ri: u32 = unsafe { ::std::mem::transmute(ri) };
            ri as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bp: u32 = unsafe { ::std::mem::transmute(bp) };
            bp as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let format: u32 = unsafe { ::std::mem::transmute(format) };
            format as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let proof: u32 = unsafe { ::std::mem::transmute(proof) };
            proof as u64
        });
        __bindgen_bitfield_unit.set(5usize, 5u8, {
            let src_extras: u32 = unsafe { ::std::mem::transmute(src_extras) };
            src_extras as u64
        });
        __bindgen_bitfield_unit.set(10usize, 5u8, {
            let dst_extras: u32 = unsafe { ::std::mem::transmute(dst_extras) };
            dst_extras as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let copy_spots: u32 = unsafe { ::std::mem::transmute(copy_spots) };
            copy_spots as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let bgr: u32 = unsafe { ::std::mem::transmute(bgr) };
            bgr as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_fz_store_hash__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<fz_store_hash__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_store_hash__bindgen_ty_1>(),
        40usize,
        concat!("Size of: ", stringify!(fz_store_hash__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_store_hash__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_store_hash__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pi) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1),
            "::",
            stringify!(pi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pir) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1),
            "::",
            stringify!(pir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).im) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1),
            "::",
            stringify!(im)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).link) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash__bindgen_ty_1),
            "::",
            stringify!(link)
        )
    );
}
#[test]
fn bindgen_test_layout_fz_store_hash() {
    const UNINIT: ::std::mem::MaybeUninit<fz_store_hash> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_store_hash>(),
        48usize,
        concat!("Size of: ", stringify!(fz_store_hash))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_store_hash>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_store_hash))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drop) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash),
            "::",
            stringify!(drop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_hash),
            "::",
            stringify!(u)
        )
    );
}
#[doc = "Every type of object to be placed into the store defines an\nfz_store_type. This contains the pointers to functions to\nmake hashes, manipulate keys, and check for needing reaping."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_store_type {
    pub name: *const ::std::os::raw::c_char,
    pub make_hash_key: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            hash: *mut fz_store_hash,
            key: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub keep_key: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            key: *mut ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub drop_key: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, key: *mut ::std::os::raw::c_void),
    >,
    pub cmp_key: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            a: *mut ::std::os::raw::c_void,
            b: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub format_key: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            buf: *mut ::std::os::raw::c_char,
            size: usize,
            key: *mut ::std::os::raw::c_void,
        ),
    >,
    pub needs_reap: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            key: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_fz_store_type() {
    const UNINIT: ::std::mem::MaybeUninit<fz_store_type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_store_type>(),
        56usize,
        concat!("Size of: ", stringify!(fz_store_type))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_store_type>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_store_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_type),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).make_hash_key) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_type),
            "::",
            stringify!(make_hash_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keep_key) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_type),
            "::",
            stringify!(keep_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drop_key) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_type),
            "::",
            stringify!(drop_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmp_key) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_type),
            "::",
            stringify!(cmp_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format_key) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_type),
            "::",
            stringify!(format_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).needs_reap) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_store_type),
            "::",
            stringify!(needs_reap)
        )
    );
}
extern "C" {
    #[doc = "Create a new store inside the context\n\nmax: The maximum size (in bytes) that the store is allowed to\ngrow to. FZ_STORE_UNLIMITED means no limit."]
    pub fn fz_new_store_context(ctx: *mut fz_context, max: usize);
}
extern "C" {
    #[doc = "Increment the reference count for the store context. Returns\nthe same pointer.\n\nNever throws exceptions."]
    pub fn fz_keep_store_context(ctx: *mut fz_context) -> *mut fz_store;
}
extern "C" {
    #[doc = "Decrement the reference count for the store context. When the\nreference count hits zero, the store context is freed.\n\nNever throws exceptions."]
    pub fn fz_drop_store_context(ctx: *mut fz_context);
}
extern "C" {
    #[doc = "Add an item to the store.\n\nAdd an item into the store, returning NULL for success. If an\nitem with the same key is found in the store, then our item will\nnot be inserted, and the function will return a pointer to that\nvalue instead. This function takes its own reference to val, as\nrequired (i.e. the caller maintains ownership of its own\nreference).\n\nkey: The key used to index the item.\n\nval: The value to store.\n\nitemsize: The size in bytes of the value (as counted towards the\nstore size).\n\ntype: Functions used to manipulate the key."]
    pub fn fz_store_item(
        ctx: *mut fz_context,
        key: *mut ::std::os::raw::c_void,
        val: *mut ::std::os::raw::c_void,
        itemsize: usize,
        type_: *const fz_store_type,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Find an item within the store.\n\ndrop: The function used to free the value (to ensure we get a\nvalue of the correct type).\n\nkey: The key used to index the item.\n\ntype: Functions used to manipulate the key.\n\nReturns NULL for not found, otherwise returns a pointer to the\nvalue indexed by key to which a reference has been taken."]
    pub fn fz_find_item(
        ctx: *mut fz_context,
        drop: fz_store_drop_fn,
        key: *mut ::std::os::raw::c_void,
        type_: *const fz_store_type,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Remove an item from the store.\n\nIf an item indexed by the given key exists in the store, remove\nit.\n\ndrop: The function used to free the value (to ensure we get a\nvalue of the correct type).\n\nkey: The key used to find the item to remove.\n\ntype: Functions used to manipulate the key."]
    pub fn fz_remove_item(
        ctx: *mut fz_context,
        drop: fz_store_drop_fn,
        key: *mut ::std::os::raw::c_void,
        type_: *const fz_store_type,
    );
}
extern "C" {
    #[doc = "Evict every item from the store."]
    pub fn fz_empty_store(ctx: *mut fz_context);
}
extern "C" {
    #[doc = "Internal function used as part of the scavenging\nallocator; when we fail to allocate memory, before returning a\nfailure to the caller, we try to scavenge space within the store\nby evicting at least 'size' bytes. The allocator then retries.\n\nsize: The number of bytes we are trying to have free.\n\nphase: What phase of the scavenge we are in. Updated on exit.\n\nReturns non zero if we managed to free any memory."]
    pub fn fz_store_scavenge(
        ctx: *mut fz_context,
        size: usize,
        phase: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "External function for callers to use\nto scavenge while trying allocations.\n\nsize: The number of bytes we are trying to have free.\n\nphase: What phase of the scavenge we are in. Updated on exit.\n\nReturns non zero if we managed to free any memory."]
    pub fn fz_store_scavenge_external(
        ctx: *mut fz_context,
        size: usize,
        phase: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Evict items from the store until the total size of\nthe objects in the store is reduced to a given percentage of its\ncurrent size.\n\npercent: %age of current size to reduce the store to.\n\nReturns non zero if we managed to free enough memory, zero\notherwise."]
    pub fn fz_shrink_store(
        ctx: *mut fz_context,
        percent: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
#[doc = "Callback function called by fz_filter_store on every item within\nthe store.\n\nReturn 1 to drop the item from the store, 0 to retain."]
pub type fz_store_filter_fn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut fz_context,
        arg: *mut ::std::os::raw::c_void,
        key: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = "Filter every element in the store with a matching type with the\ngiven function.\n\nIf the function returns 1 for an element, drop the element."]
    pub fn fz_filter_store(
        ctx: *mut fz_context,
        fn_: fz_store_filter_fn,
        arg: *mut ::std::os::raw::c_void,
        type_: *const fz_store_type,
    );
}
extern "C" {
    #[doc = "Filter the store and throw away any stored tiles drawn for a\ngiven document."]
    pub fn fz_drop_drawn_tiles_for_document(ctx: *mut fz_context, doc: *mut fz_document);
}
extern "C" {
    #[doc = "Output debugging information for the current state of the store\nto the given output channel."]
    pub fn fz_debug_store(ctx: *mut fz_context, out: *mut fz_output);
}
extern "C" {
    #[doc = "Increment the defer reap count.\n\nNo reap operations will take place (except for those\ntriggered by an immediate failed malloc) until the\ndefer reap count returns to 0.\n\nCall this at the start of a process during which you\npotentially might drop many reapable objects.\n\nIt is vital that every fz_defer_reap_start is matched\nby a fz_defer_reap_end call."]
    pub fn fz_defer_reap_start(ctx: *mut fz_context);
}
extern "C" {
    #[doc = "Decrement the defer reap count.\n\nIf the defer reap count returns to 0, and the store\nhas reapable objects in, a reap pass will begin.\n\nCall this at the end of a process during which you\npotentially might drop many reapable objects.\n\nIt is vital that every fz_defer_reap_start is matched\nby a fz_defer_reap_end call."]
    pub fn fz_defer_reap_end(ctx: *mut fz_context);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_icc_profile {
    _unused: [u8; 0],
}
pub const FZ_RI_PERCEPTUAL: _bindgen_ty_6 = 0;
pub const FZ_RI_RELATIVE_COLORIMETRIC: _bindgen_ty_6 = 1;
pub const FZ_RI_SATURATION: _bindgen_ty_6 = 2;
pub const FZ_RI_ABSOLUTE_COLORIMETRIC: _bindgen_ty_6 = 3;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
pub const FZ_RI_IN_SOFTMASK: _bindgen_ty_7 = 128;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_color_params {
    pub ri: u8,
    pub bp: u8,
    pub op: u8,
    pub opm: u8,
}
#[test]
fn bindgen_test_layout_fz_color_params() {
    const UNINIT: ::std::mem::MaybeUninit<fz_color_params> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_color_params>(),
        4usize,
        concat!("Size of: ", stringify!(fz_color_params))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_color_params>(),
        1usize,
        concat!("Alignment of ", stringify!(fz_color_params))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ri) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_color_params),
            "::",
            stringify!(ri)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bp) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_color_params),
            "::",
            stringify!(bp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).op) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_color_params),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opm) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_color_params),
            "::",
            stringify!(opm)
        )
    );
}
extern "C" {
    #[doc = "Map from (case sensitive) rendering intent string to enumeration\nvalue."]
    pub fn fz_lookup_rendering_intent(name: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Map from enumerated rendering intent to string.\n\nThe returned string is static and therefore must not be freed."]
    pub fn fz_rendering_intent_name(ri: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
pub const FZ_MAX_COLORS: _bindgen_ty_8 = 32;
#[doc = "The maximum number of colorants available in any given\ncolor/colorspace (not including alpha).\n\nChanging this value will alter the amount of memory being used\n(both stack and heap space), but not hugely. Speed should\n(largely) be determined by the number of colors actually used."]
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub const FZ_MAX_SAMPLES: _bindgen_ty_9 = 1073741824;
#[doc = "The maximum number of images samples allowed in any given image.\n\nThis limit is checked when allocating images."]
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const fz_colorspace_type_FZ_COLORSPACE_NONE: fz_colorspace_type = 0;
pub const fz_colorspace_type_FZ_COLORSPACE_GRAY: fz_colorspace_type = 1;
pub const fz_colorspace_type_FZ_COLORSPACE_RGB: fz_colorspace_type = 2;
pub const fz_colorspace_type_FZ_COLORSPACE_BGR: fz_colorspace_type = 3;
pub const fz_colorspace_type_FZ_COLORSPACE_CMYK: fz_colorspace_type = 4;
pub const fz_colorspace_type_FZ_COLORSPACE_LAB: fz_colorspace_type = 5;
pub const fz_colorspace_type_FZ_COLORSPACE_INDEXED: fz_colorspace_type = 6;
pub const fz_colorspace_type_FZ_COLORSPACE_SEPARATION: fz_colorspace_type = 7;
pub type fz_colorspace_type = ::std::os::raw::c_uint;
pub const FZ_COLORSPACE_IS_DEVICE: _bindgen_ty_10 = 1;
pub const FZ_COLORSPACE_IS_ICC: _bindgen_ty_10 = 2;
pub const FZ_COLORSPACE_HAS_CMYK: _bindgen_ty_10 = 4;
pub const FZ_COLORSPACE_HAS_SPOTS: _bindgen_ty_10 = 8;
pub const FZ_COLORSPACE_HAS_CMYK_AND_SPOTS: _bindgen_ty_10 = 12;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
extern "C" {
    #[doc = "Creates a new colorspace instance and returns a reference.\n\nNo internal checking is done that the colorspace type (e.g.\nCMYK) matches with the flags (e.g. FZ_COLORSPACE_HAS_CMYK) or\ncolorant count (n) or name.\n\nThe reference should be dropped when it is finished with.\n\nColorspaces are immutable once created (with the exception of\nsetting up colorant names for separation spaces)."]
    pub fn fz_new_colorspace(
        ctx: *mut fz_context,
        type_: fz_colorspace_type,
        flags: ::std::os::raw::c_int,
        n: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
    ) -> *mut fz_colorspace;
}
extern "C" {
    #[doc = "Increment the reference count for the colorspace.\n\nReturns the same pointer. Never throws an exception."]
    pub fn fz_keep_colorspace(
        ctx: *mut fz_context,
        colorspace: *mut fz_colorspace,
    ) -> *mut fz_colorspace;
}
extern "C" {
    #[doc = "Drops a reference to the colorspace.\n\nWhen the reference count reaches zero, the colorspace is\ndestroyed."]
    pub fn fz_drop_colorspace(ctx: *mut fz_context, colorspace: *mut fz_colorspace);
}
extern "C" {
    #[doc = "Create an indexed colorspace.\n\nThe supplied lookup table is high palette entries long. Each\nentry is n bytes long, where n is given by the number of\ncolorants in the base colorspace, one byte per colorant.\n\nOwnership of lookup is passed it; it will be freed on\ndestruction, so must be heap allocated.\n\nThe colorspace will keep an additional reference to the base\ncolorspace that will be dropped on destruction.\n\nThe returned reference should be dropped when it is finished\nwith.\n\nColorspaces are immutable once created."]
    pub fn fz_new_indexed_colorspace(
        ctx: *mut fz_context,
        base: *mut fz_colorspace,
        high: ::std::os::raw::c_int,
        lookup: *mut ::std::os::raw::c_uchar,
    ) -> *mut fz_colorspace;
}
extern "C" {
    #[doc = "Create a colorspace from an ICC profile supplied in buf.\n\nLimited checking is done to ensure that the colorspace type is\nappropriate for the supplied ICC profile.\n\nAn additional reference is taken to buf, which will be dropped\non destruction. Ownership is NOT passed in.\n\nThe returned reference should be dropped when it is finished\nwith.\n\nColorspaces are immutable once created."]
    pub fn fz_new_icc_colorspace(
        ctx: *mut fz_context,
        type_: fz_colorspace_type,
        flags: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        buf: *mut fz_buffer,
    ) -> *mut fz_colorspace;
}
extern "C" {
    #[doc = "Create a calibrated gray colorspace.\n\nThe returned reference should be dropped when it is finished\nwith.\n\nColorspaces are immutable once created."]
    pub fn fz_new_cal_gray_colorspace(
        ctx: *mut fz_context,
        wp: *mut f32,
        bp: *mut f32,
        gamma: f32,
    ) -> *mut fz_colorspace;
}
extern "C" {
    #[doc = "Create a calibrated rgb colorspace.\n\nThe returned reference should be dropped when it is finished\nwith.\n\nColorspaces are immutable once created."]
    pub fn fz_new_cal_rgb_colorspace(
        ctx: *mut fz_context,
        wp: *mut f32,
        bp: *mut f32,
        gamma: *mut f32,
        matrix: *mut f32,
    ) -> *mut fz_colorspace;
}
extern "C" {
    #[doc = "Query the type of colorspace."]
    pub fn fz_colorspace_type(ctx: *mut fz_context, cs: *mut fz_colorspace) -> fz_colorspace_type;
}
extern "C" {
    #[doc = "Query the name of a colorspace.\n\nThe returned string has the same lifespan as the colorspace\ndoes. Caller should not free it."]
    pub fn fz_colorspace_name(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Query the number of colorants in a colorspace."]
    pub fn fz_colorspace_n(ctx: *mut fz_context, cs: *mut fz_colorspace) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "True for CMYK, Separation and DeviceN colorspaces."]
    pub fn fz_colorspace_is_subtractive(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "True if DeviceN color space has only colorants from the CMYK set."]
    pub fn fz_colorspace_device_n_has_only_cmyk(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "True if DeviceN color space has cyan magenta yellow or black as\none of its colorants."]
    pub fn fz_colorspace_device_n_has_cmyk(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Tests for particular types of colorspaces"]
    pub fn fz_colorspace_is_gray(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_rgb(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_cmyk(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_lab(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_indexed(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_icc(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_device_n(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_device(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_device_gray(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_device_cmyk(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_colorspace_is_lab_icc(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Get checksum of underlying ICC profile."]
    pub fn fz_colorspace_digest(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
        digest: *mut ::std::os::raw::c_uchar,
    );
}
extern "C" {
    #[doc = "Check to see that a colorspace is appropriate to be used as\na blending space (i.e. only grey, rgb or cmyk)."]
    pub fn fz_is_valid_blend_colorspace(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "Get the 'base' colorspace for a colorspace.\n\nFor indexed colorspaces, this is the colorspace the index\ndecodes into. For all other colorspaces, it is the colorspace\nitself.\n\nThe returned colorspace is 'borrowed' (i.e. no additional\nreferences are taken or dropped)."]
    pub fn fz_base_colorspace(ctx: *mut fz_context, cs: *mut fz_colorspace) -> *mut fz_colorspace;
}
extern "C" {
    #[doc = "Retrieve global default colorspaces.\n\nThese return borrowed references that should not be dropped,\nunless they are kept first."]
    pub fn fz_device_gray(ctx: *mut fz_context) -> *mut fz_colorspace;
}
extern "C" {
    pub fn fz_device_rgb(ctx: *mut fz_context) -> *mut fz_colorspace;
}
extern "C" {
    pub fn fz_device_bgr(ctx: *mut fz_context) -> *mut fz_colorspace;
}
extern "C" {
    pub fn fz_device_cmyk(ctx: *mut fz_context) -> *mut fz_colorspace;
}
extern "C" {
    pub fn fz_device_lab(ctx: *mut fz_context) -> *mut fz_colorspace;
}
extern "C" {
    #[doc = "Assign a name for a given colorant in a colorspace.\n\nUsed while initially setting up a colorspace. The string is\ncopied into local storage, so need not be retained by the\ncaller."]
    pub fn fz_colorspace_name_colorant(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
        n: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Retrieve a the name for a colorant.\n\nReturns a pointer with the same lifespan as the colorspace."]
    pub fn fz_colorspace_colorant(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
        n: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = "Clamp the samples in a color to the correct ranges for a\ngiven colorspace."]
    pub fn fz_clamp_color(
        ctx: *mut fz_context,
        cs: *mut fz_colorspace,
        in_: *const f32,
        out: *mut f32,
    );
}
extern "C" {
    #[doc = "Convert color values sv from colorspace ss into colorvalues dv\nfor colorspace ds, via an optional intervening space is,\nrespecting the given color_params."]
    pub fn fz_convert_color(
        ctx: *mut fz_context,
        ss: *mut fz_colorspace,
        sv: *const f32,
        ds: *mut fz_colorspace,
        dv: *mut f32,
        is: *mut fz_colorspace,
        params: fz_color_params,
    );
}
#[doc = "Structure to hold default colorspaces."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_default_colorspaces {
    pub refs: ::std::os::raw::c_int,
    pub gray: *mut fz_colorspace,
    pub rgb: *mut fz_colorspace,
    pub cmyk: *mut fz_colorspace,
    pub oi: *mut fz_colorspace,
}
#[test]
fn bindgen_test_layout_fz_default_colorspaces() {
    const UNINIT: ::std::mem::MaybeUninit<fz_default_colorspaces> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_default_colorspaces>(),
        40usize,
        concat!("Size of: ", stringify!(fz_default_colorspaces))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_default_colorspaces>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_default_colorspaces))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_default_colorspaces),
            "::",
            stringify!(refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gray) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_default_colorspaces),
            "::",
            stringify!(gray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rgb) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_default_colorspaces),
            "::",
            stringify!(rgb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmyk) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_default_colorspaces),
            "::",
            stringify!(cmyk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oi) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_default_colorspaces),
            "::",
            stringify!(oi)
        )
    );
}
extern "C" {
    #[doc = "Create a new default colorspace structure with values inherited\nfrom the context, and return a reference to it.\n\nThese can be overridden using fz_set_default_xxxx.\n\nThese should not be overridden while more than one caller has\nthe reference for fear of race conditions.\n\nThe caller should drop this reference once finished with it."]
    pub fn fz_new_default_colorspaces(ctx: *mut fz_context) -> *mut fz_default_colorspaces;
}
extern "C" {
    #[doc = "Keep an additional reference to the default colorspaces\nstructure.\n\nNever throws exceptions."]
    pub fn fz_keep_default_colorspaces(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
    ) -> *mut fz_default_colorspaces;
}
extern "C" {
    #[doc = "Drop a reference to the default colorspaces structure. When the\nreference count reaches 0, the references it holds internally\nto the underlying colorspaces will be dropped, and the structure\nwill be destroyed.\n\nNever throws exceptions."]
    pub fn fz_drop_default_colorspaces(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
    );
}
extern "C" {
    #[doc = "Returns a reference to a newly cloned default colorspaces\nstructure.\n\nThe new clone may safely be altered without fear of race\nconditions as the caller is the only reference holder."]
    pub fn fz_clone_default_colorspaces(
        ctx: *mut fz_context,
        base: *mut fz_default_colorspaces,
    ) -> *mut fz_default_colorspaces;
}
extern "C" {
    #[doc = "Retrieve default colorspaces (typically page local).\n\nIf default_cs is non NULL, the default is retrieved from there,\notherwise the global default is retrieved.\n\nThese return borrowed references that should not be dropped,\nunless they are kept first."]
    pub fn fz_default_gray(
        ctx: *mut fz_context,
        default_cs: *const fz_default_colorspaces,
    ) -> *mut fz_colorspace;
}
extern "C" {
    pub fn fz_default_rgb(
        ctx: *mut fz_context,
        default_cs: *const fz_default_colorspaces,
    ) -> *mut fz_colorspace;
}
extern "C" {
    pub fn fz_default_cmyk(
        ctx: *mut fz_context,
        default_cs: *const fz_default_colorspaces,
    ) -> *mut fz_colorspace;
}
extern "C" {
    pub fn fz_default_output_intent(
        ctx: *mut fz_context,
        default_cs: *const fz_default_colorspaces,
    ) -> *mut fz_colorspace;
}
extern "C" {
    #[doc = "Set new defaults within the default colorspace structure.\n\nNew references are taken to the new default, and references to\nthe old defaults dropped.\n\nNever throws exceptions."]
    pub fn fz_set_default_gray(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
        cs: *mut fz_colorspace,
    );
}
extern "C" {
    pub fn fz_set_default_rgb(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
        cs: *mut fz_colorspace,
    );
}
extern "C" {
    pub fn fz_set_default_cmyk(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
        cs: *mut fz_colorspace,
    );
}
extern "C" {
    pub fn fz_set_default_output_intent(
        ctx: *mut fz_context,
        default_cs: *mut fz_default_colorspaces,
        cs: *mut fz_colorspace,
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct fz_colorspace {
    pub key_storable: fz_key_storable,
    pub type_: fz_colorspace_type,
    pub flags: ::std::os::raw::c_int,
    pub n: ::std::os::raw::c_int,
    pub name: *mut ::std::os::raw::c_char,
    pub u: fz_colorspace__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union fz_colorspace__bindgen_ty_1 {
    pub icc: fz_colorspace__bindgen_ty_1__bindgen_ty_1,
    pub indexed: fz_colorspace__bindgen_ty_1__bindgen_ty_2,
    pub separation: fz_colorspace__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_colorspace__bindgen_ty_1__bindgen_ty_1 {
    pub buffer: *mut fz_buffer,
    pub md5: [::std::os::raw::c_uchar; 16usize],
    pub profile: *mut fz_icc_profile,
}
#[test]
fn bindgen_test_layout_fz_colorspace__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<fz_colorspace__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).md5) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(md5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).profile) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(profile)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_colorspace__bindgen_ty_1__bindgen_ty_2 {
    pub base: *mut fz_colorspace,
    pub high: ::std::os::raw::c_int,
    pub lookup: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_fz_colorspace__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<fz_colorspace__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).high) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(high)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lookup) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(lookup)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_colorspace__bindgen_ty_1__bindgen_ty_3 {
    pub base: *mut fz_colorspace,
    pub eval: ::std::option::Option<
        unsafe extern "C" fn(
            ctx: *mut fz_context,
            tint: *mut ::std::os::raw::c_void,
            s: *const f32,
            sn: ::std::os::raw::c_int,
            d: *mut f32,
            dn: ::std::os::raw::c_int,
        ),
    >,
    pub drop: ::std::option::Option<
        unsafe extern "C" fn(ctx: *mut fz_context, tint: *mut ::std::os::raw::c_void),
    >,
    pub tint: *mut ::std::os::raw::c_void,
    pub colorant: [*mut ::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_fz_colorspace__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<fz_colorspace__bindgen_ty_1__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_3>(),
        288usize,
        concat!(
            "Size of: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<fz_colorspace__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eval) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(eval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drop) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(drop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tint) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(tint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorant) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(colorant)
        )
    );
}
#[test]
fn bindgen_test_layout_fz_colorspace__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<fz_colorspace__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_colorspace__bindgen_ty_1>(),
        288usize,
        concat!("Size of: ", stringify!(fz_colorspace__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_colorspace__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_colorspace__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).icc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1),
            "::",
            stringify!(icc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).indexed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1),
            "::",
            stringify!(indexed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).separation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace__bindgen_ty_1),
            "::",
            stringify!(separation)
        )
    );
}
#[test]
fn bindgen_test_layout_fz_colorspace() {
    const UNINIT: ::std::mem::MaybeUninit<fz_colorspace> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_colorspace>(),
        344usize,
        concat!("Size of: ", stringify!(fz_colorspace))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_colorspace>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_colorspace))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_storable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace),
            "::",
            stringify!(key_storable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_colorspace),
            "::",
            stringify!(u)
        )
    );
}
extern "C" {
    pub fn fz_drop_colorspace_imp(ctx: *mut fz_context, cs_: *mut fz_storable);
}
extern "C" {
    pub fn fz_iso8859_1_from_unicode(u: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_iso8859_7_from_unicode(u: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_koi8u_from_unicode(u: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_windows_1250_from_unicode(u: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_windows_1251_from_unicode(u: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_windows_1252_from_unicode(u: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_unicode_from_glyph_name(name: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_unicode_from_glyph_name_strict(
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fz_duplicate_glyph_names_from_unicode(
        unicode: ::std::os::raw::c_int,
    ) -> *mut *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fz_glyph_name_from_unicode_sc(
        unicode: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fz_text_decoder {
    pub decode_bound: ::std::option::Option<
        unsafe extern "C" fn(
            dec: *mut fz_text_decoder,
            input: *mut ::std::os::raw::c_uchar,
            n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub decode_size: ::std::option::Option<
        unsafe extern "C" fn(
            dec: *mut fz_text_decoder,
            input: *mut ::std::os::raw::c_uchar,
            n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub decode: ::std::option::Option<
        unsafe extern "C" fn(
            dec: *mut fz_text_decoder,
            output: *mut ::std::os::raw::c_char,
            input: *mut ::std::os::raw::c_uchar,
            n: ::std::os::raw::c_int,
        ),
    >,
    pub table1: *mut ::std::os::raw::c_void,
    pub table2: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_fz_text_decoder() {
    const UNINIT: ::std::mem::MaybeUninit<fz_text_decoder> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fz_text_decoder>(),
        40usize,
        concat!("Size of: ", stringify!(fz_text_decoder))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_text_decoder>(),
        8usize,
        concat!("Alignment of ", stringify!(fz_text_decoder))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decode_bound) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_text_decoder),
            "::",
            stringify!(decode_bound)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decode_size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_text_decoder),
            "::",
            stringify!(decode_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_text_decoder),
            "::",
            stringify!(decode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).table1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_text_decoder),
            "::",
            stringify!(table1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).table2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fz_text_decoder),
            "::",
            stringify!(table2)
        )
    );
}
extern "C" {
    pub fn fz_init_text_decoder(
        ctx: *mut fz_context,
        dec: *mut fz_text_decoder,
        encoding: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = "Retrieve the FT_Face handle\nfor the font.\n\nfont: The font to query\n\nReturns the FT_Face handle for the font, or NULL\nif not a freetype handled font. (Cast to void *\nto avoid nasty header exposure)."]
    pub fn fz_font_ft_face(ctx: *mut fz_context, font: *mut fz_font)
        -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = "Retrieve the Type3 procs\nfor a font.\n\nfont: The font to query\n\nReturns the t3_procs pointer. Will be NULL for a\nnon type-3 font."]
    pub fn fz_font_t3_procs(ctx: *mut fz_context, font: *mut fz_font) -> *mut *mut fz_buffer;
}
pub const FZ_ADOBE_CNS: _bindgen_ty_11 = 0;
pub const FZ_ADOBE_GB: _bindgen_ty_11 = 1;
pub const FZ_ADOBE_JAPAN: _bindgen_ty_11 = 2;
pub const FZ_ADOBE_KOREA: _bindgen_ty_11 = 3;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
#[doc = "Every fz_font carries a set of flags\nwithin it, in a fz_font_flags_t structure."]
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct fz_font_flags_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub __bindgen_padding_0: u16,
}
#[test]
fn bindgen_test_layout_fz_font_flags_t() {
    assert_eq!(
        ::std::mem::size_of::<fz_font_flags_t>(),
        4usize,
        concat!("Size of: ", stringify!(fz_font_flags_t))
    );
    assert_eq!(
        ::std::mem::align_of::<fz_font_flags_t>(),
        4usize,
        concat!("Alignment of ", stringify!(fz_font_flags_t))
    );
}
impl fz_font_flags_t {
    #[inline]
    pub fn is_mono(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_mono(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_serif(&self) -> ::std::os::raw::c_uint {
